[{"id": "1828792406", "title": "Barony Wicked Rendition", "file_size": 110430031, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1021700308760360974/39E29D85302A5DE6176E890D5471E0F53E58001F/", "description": "---PLEASE READ THE INSTALL INSTRUCTIONS BEFORE PLAYING--- ________________________________________________________________________________ Wicked Rendition is mod that aims at adding content with... New areas! Multiple paths are now a thing! At level 4(in the last mines level) you may choose to go to the Jungle or adventure into the collapsing City. You can go to the Sand Labyrinth or maybe discover the secrets of the Tundra. There is also the Catacombs you can go instead of the Ruins. It's filled with demons, and eyeballs, and all sort of gross stuff. There are a few other ones, but I won't tell you about it! Go find it. New Items! 50+ items to discover. including weapons, armor, food, books, and silly hats. New Classes! Play as The Sharpshooter, a long range fighter. The Prophet, a healer that can sacrifice health for power. The Tourist, starts with random equipment. Or... The Lunatic, because only a lunatic would play this class. New foes! There are 19 new monsters to fight, weak and strong. Cockroaches, gragoyles, yetis, eyeballs, dust devils. just to name a few. Mini-Bosses and Legendaries! Funny Bones, The Potato King, and Shelob have some new friends, they bring new dangers, and new treasures. New monster have mini-bosses too. ________________________________________________________________________________ INSTALL INSTRUCTIONS: - Subscribe to the mod. - Go to the Workshop directory ...\\Steam\\steamapps\\workshop\\content\\371970\\1828792406 - Copy all of the files and folders. - Go to the Barony directory ...\\Steam\\steamapps\\common\\Barony. - Paste all the files there(NOT in the 'mods' folder). If this don't work, you may also need to: - Delete(or backup) your score.dat and scores_multiplayer.dat those are your highscores (make a backup if don't want to lose them). - Make sure your \"savegames\" file is empty. (This version only works on Steam) ________________________________________________________________________________ LINKS: Non-Steam version: https://www.moddb.com/mods/barony-wicked-rendition Map of the WR levels: https://imgur.com/a/xsn4KNH Official for comparison: https://imgur.com/a/135uAtX Code: https://github.com/Lucs6/Barony OST: https://soundcloud.com/kww-220530745 ________________________________________________________________________________ That's all, to go back to the original game you can verify the game's cache using steam's properties or make a backup of the original barony files. May not work with similar mods (The majority of mods are fine).", "time_created": 1565282011, "time_updated": 1593445566, "views": 18276, "favorited": 422, "tags": ["models  ", "dungeons", "audio", "misc", "gameplay", "textures", "v3.2.3", "v3.2.4", "v3.3.3", "v3.3.4"], "votes": {"up": 177, "down": 7}}, {"id": "1517790477", "title": "Barony 20XX v1.0 (Total Conversion)", "file_size": 163786882, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1188335431783098888/1599F1EEEB7830CCF52A385648670D734B77FC51/", "description": "What is Barony 20XX? Barony 20XX is a total conversion mod for Barony - New books, models, sounds, icons, music, and more! Currently the content goes as far as completely converting everything in the initial release of the game, so hell and the crystal mines haven't been replaced just yet, however a lot of the content that carries over into a new game and early game loot tables has been replaced for consistency, though you will notice some items (like Quivers) from newer patches are missing. These will be implemented eventually! Our goal is to recontextualise the setting of Barony, while taking care to keep the experience as close to vanilla as possible - be it the books, the items, or the nomenclature - we're hoping this mod can be seen as an alternative skin for the base game for those who prefer Cyberpunk to Fantasy rather than a must-have replacement. This has been 2 years in the making, and we at Studio Dreamlance truly hope you enjoy it. Thank you! The Story so Far... Once, there was a great city of glass and steel. For many years this city stood as a monument to industry and commerce, its citizens wanting for nothing. That was, until Wallace Herx took control of the corporations. Ruthless and uncaring, Herx saw value only in the bottom line, Profit, no matter the cost. Conditions for the workers decreased ever more drastically, miring the city in crime, drug abuse, and poverty. With wages decreasing and property prices inflating, those who could not afford the luxury of space in this new metropolis were priced out into the slums. Herx, rich beyond compare, retreated to the summit of his great skyscraper, which towers menacingly over the city. His fortune, however, did not go unnoticed by envious eyes. A hit was put out on Herx by an unknown party, promising their share of the spoils to any who could reach and kill him. But a maddening Herx only fortified his redoubt, hiding away behind layers of the best security money could buy. Nobody has seen him in years. And the city around him fell into decay. Grand towers imposing over the hungry masses below - their wealthy occupants blissfully ignorant of the numbing poverty below. And though many have tried and failed, they say that you too could attain the vast wealth of those above, if only you can reach the top. Features A full recontextualisation of the original Barony story. Through filler text and books, the futuristic setting will be explained to you much as the original story was presented, while keeping themes and the tone accurate to the original Full graphical redesign! Tiles, models, icons, UI, and more! New soundtrack, featuring Synthwave and Industrial tracks New sound effects A brand new bestiary of robotic enemies to best on your way to assassinating Wallace Herx Fully rewritten books Completely rewritten terminology - all text now serves to immerse you in the Cyberpunk world! Almost 1:1 map design with vanilla Barony, only changing floors if they would otherwise ruin immersion Installation Instructions Asset swapping is no longer a requirement - just subscribing should install the mod just fine! Who are Studio Dreamlance? We are an ever-expanding group of volunteer game developers and modders, slowly putting together a multitude of projects in our spare time with the hope we can one day make the dream of a full-time game studio a reality. Bugs & Feedback If you'd like to leave us any feedback or make us aware of any problems with this mod, please let us know using the appropriate forms Feedback form: https://docs.google.com/forms/d/1HusdLIeieHN6UlaJerM9YuZcDxCsamkxjt5Gu58Eg0Q/edit Bug report form: https://docs.google.com/forms/d/1i2UZ7G_TZ24O72Q8XhZlsl7ZYUd3hlbZfD03Y0Qlou0/edit Known Issues Rare spawn minbosses are not renamed Certain assets need to be swapped out manually Some icons are a bit too dark to see clearly in the inventory. This may need a rethink on how 20XX icons are designed. Content from later versions (hell, crystal caverns) still remaining No \"victory\" screen, as it ties in with content that hasn't been added yet A lot of the models were made 2 years ago when I had 0 voxel experience. Lots has been learned since then, and there's room for improvement across the board (lots of recolours and weird voxelshop hackiness) Spell names unfortunately cannot be changed Credits Lead Artist & Designer, Producer, Sound Design, Cyborg Voice, - Caladrius Tile Art, Special Forces Voice, Additional Writing - Ryan Newell Wallace Herx Voice - Kyle Wallace Writer (Books) - Bertie Titterton Writer (Books, Additional), Replicant Voice - Callum Craig 3D Artist - Cyrano CC0 Public Domain music sourced from https://freemusicarchive.org/ CC0 Public Domain sounds sourced from https://freesound.org/", "time_created": 1592063441, "time_updated": 1593080291, "views": 10776, "favorited": 219, "tags": ["models  ", "textures", "misc", "audio", "v3.3.4"], "votes": {"up": 101, "down": 1}}, {"id": "1939517515", "title": "Merry Barony Christmas", "file_size": 53298785, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/789751372435328482/0308FDF4BE2DF7B96FE226974170C5DA246F99CE/", "description": "Description: Festive rogue fantasy! Bring Christmas models, textures, sounds and music to your favorite first-person roguelike. Exclusively replaces a selection of standard assets, resulting in a vanilla gameplay experience with Christmas-themed aesthetics. Don't worry, you'll still be able to get all the achievements with this mod enabled! Want to wear a goofy reindeer helmet? Want to wander the snowy ice labyrinths instead of the sandy ones? Want to hear spooky Christmas music? Want sleighbells attached to your boots? This is the Workshop item for you! v1.3 Very Merry Barony Christmas Holiday 2020 Update Added Christmas decor to Caves and Citadel meshes and textures Replaced sounds for Santa's elves (Gnomes) Made tables and chairs more Christmassy Replaced food art with holiday food items Decorated fountains with stockings and ornaments Made shop shelves a little more festive Gave Herx festive colors Added blinking Christmas light decor to Hell Added trailer to Steam store page Trailer Music Credit: Alexander Nakarada - Christmas Metal - Jingle Bells (https://www.serpentsoundstudios.com/19-christmas-metal) v1.2 Updated the steel helmets to use various states of snowman heads Added hat and scarf to Crystal Golems Replaced the snowman crystal helmet with a fleece winter cap version Updated the Christmas tree wizard hat Replaced tombstones with Christmas trees Replaced Ghouls with snowmen v1.1 Added a cheery shop theme Replaced mystic orbs with Christmas items v1.0 Spooky Christmas music by \"Myuu\" has been spread throughout the game. Replaced two looked-over labyrinth tiles to complete its ice-palace aesthetic. Added evergreen garlands to grey brick tiles. v0.9 Initial suite of voxel models and map tile asset replacements, added sleigh bells to footsteps. Check out Myuu's Youtube: https://www.youtube.com/channel/UCiSKnkKCKAQVxMUWpZQobuQ", "time_created": 1576649953, "time_updated": 1606162957, "views": 3128, "favorited": 82, "tags": ["models  ", "audio", "textures", "v3.2.3", "v3.3.0", "v3.3.7"], "votes": {"up": 78, "down": 1}}, {"id": "2612424349", "title": "Barony Scarony - Halloween Celebration!", "file_size": 77183009, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1636486339006398515/048F591991695FA711A24CDE7838367B00D5672E/", "description": "Get spooky in the dungeon! Bring Halloween models, textures, sounds and music to Barony. Go trick-or-treating, have a costume party, and encounter scarier settings all without modifying any gameplay or invalidating any achievements. Details: Mix hoods, hats and capes to create fun costume combinations. Take on a number of disguises, including pirates, angels, fairies, clowns and other Halloween classics. A number of weapons have also been replaced to reflect Halloween store mainstays, like the devils' pitchfork, and a selection of slasher-style weapons from scary urban legends. Food has been replaced with Halloween sweet treats. All of the music has also been replaced with haunting tracks sourced from the internet. Combined with retextured dungeon walls, floors, and replaced decor items, no matter where you go in Barony, you'll have a taste of your favorite terrorific holiday. All this and much more! We made lots of things to help you build a costume in the game! It starts as soon as you pick your class and race. Each of the three human skintones now have four face paint options: White Grease Paint Incubus / Succubus Face Paint Ghoul Face Paint Superhero Eyemask Note, some weapons have been changed and the skills they use may be less obvious. They are as follows: Bronze sword is now butcher knife (swords) Bronze axe is now cleaver (axes) Bronze mace is now bat (maces) Iron sword is now iron cutlass (swords) Iron axe is now iron hook (axes) Iron mace is now iron hammer (maces) Iron spear is now pitchfork (polearms) Steel axe is now batwing axe (axes) Steel halberd is now steel scythe (polearm) Again this mod is aesthetic only, so you can use it in multiplayer games and on your achievement hunts with absolutely no disruptions to gameplay. v1.0 Updated world tile textures to include additional hand-painted details Added five additional monster changes Corrected errors on some of the v0.9 voxel and icon art Fixed food quality names in some places Added trailer to the workshop item v0.9 Initial release MUSIC CREDITS The rest of this description contains exclusively music credits. I want to give a big shout out to the artists who put their music up for free on the internet. It just wouldn't feel like a total Halloween conversion without spooky music! As Barony itself has an open-source codebase, we love and appreciate the free music. So a big thank you to those talented musicians below! mines01 \"Ross Bugden - Haunted\" is under a Free To Use on YouTube license Music promoted by BreakingCopyright: https://youtu.be/uQbzK4OROjQ labyrinth01 \"Tim Beek - Ghost\" is under a Free To Use on YouTube license Music promoted by BreakingCopyright: https://bit.ly/tim-beek-ghost minotaur01 \"Audionautix - Horror Music\" is free to use in your projects. Music promoted by BreakingCopyright: https://youtu.be/17tPrShGY5U citadel01 \"Darren Curtis - It's In The Fog\" is under a Creative Commons license (CC BY 3.0). https://www.youtube.com/c/DarrenCurti... Music promoted by BreakingCopyright: https://bit.ly/b-in-the-fog mines04 'Dystopia' by Neutrin05 is under a Creative Commons license (CC BY 3.0) Music promoted by BreakingCopyright: http://bit.ly/Neutrin05-Dystopia\" caves01 \"Torin - Tubular Bells \" is under a Creative Commons license (CC BY-SA 3.0) Music promoted by BreakingCopyright: http://bit.ly/2k0NUqM swamp00 \"TeknoAXE - Halloween Chaser\" is under a Creative Commons license (CC BY 4.0). Music promoted by BreakingCopyright: http://bit.ly/2RiiRVU herxboss \"Cjbeards - Shattered Glass\" is under a Creative Commons (CC-BY 3.0) license Music promoted by BreakingCopyright: https://bit.ly/bkc-shattered-glass caves02 & swamp03 \"Miguel Johnson - 2184\" is under a Creative Commons (CC-BY 3.0) license https://www.youtube.com/c/MiguelJohnson Music promoted by BreakingCopyright: https://bit.ly/bc-2184-song labyrinth02 \"Myuu - Don't Die On Me\" is under a Creative Commons (CC BY 3.0) license. https://www.youtube.com/myuuji 🎵 Music provided by BreakingCopyright: https://youtu.be/t2fOvGDnin0 intro01 \"Arthur Vyncke - Ghost of the Kitchen\" is under a Creative Commons (CC BY-SA 3.0) license. https://soundcloud.com/arthurvost 🎵 Music promoted by BreakingCopyright: https://youtu.be/9GA2a28jPIw ruin01 \" The House\" composed and produced by \"Vivek Abhishek\" library \" Dark Horror Theme \" composed and produced by \"Vivek Abhishek\" mines02 Author Unknown, Copyright Free mines03 \"Broken Piano \" composed and produced by \"Vivek Abhishek\" ruin01 \"MELANCHOLIA\" Ryan Creep swamp02 \"Dark Tension Rising\" Mattia Cupelli citadel02 \"Forgotten\" REPULSIVE https://soundcloud.com/repulsivesound swamp01 \"Horror Ambiance\" ESN Productions caves00 \"Background Suspence Music\" Feslyian Studios shop \"Carnival Freaks\" Myuu sanctum \"Something Wicked\" Ross Budgen intro \"Grotesque Fantasia\" Myuu labyrinth00 \"Halloween 2017\" Chris Hayes endgame \"Spook Box\" Myuu ruins00 \"Creepy Clown Symphony\" Myuu minetown \"Come Play with Me\" Kevin MacLeod temple \"Asian Graveyard\" Darren Curtis intro02 \"Collapse\" Myuu citadel00 \"Dark Mysterious Music\" Power Music Factory intermission \"Haunted House\" Myuu mines00 \"Sinister\" VIVEK ABHISHEK", "time_created": 1632688342, "time_updated": 1633673212, "views": 3999, "favorited": 77, "tags": ["textures", "models  ", "audio", "v3.3.7"], "votes": {"up": 83, "down": 1}}, {"id": "1463240072", "title": "Tears of Joy Boulder", "file_size": 669656, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/960841947969655030/4724328F05A706CC36B270D3C2F34158FE38702F/", "description": "A simple Boulder Reskin for spicy bois. This is so epic can we inhale oxygen and exhale carbon dioxide, like, comment and share!!!", "time_created": 1533258161, "time_updated": 1533258161, "views": 5627, "favorited": 79, "tags": ["models  ", "audio", "v3.1.7"], "votes": {"up": 99, "down": 9}}, {"id": "1928863533", "title": "More room [25.11.20]", "file_size": 155853811, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1470941285213920322/8C0B28921D366EBF1B250B4178B30D212FA6D72C/", "description": "More adventures and dangers for you and your friends. I advise you to read the description to avoid most mod errors. Unfortunately, More room does not support other mods. In most cases their installation will lead to errors and flags and desync between players Changes: Disables the appearance of a secret room on fixed levels. (Because of the addition of new secret levels, this is the best solution. The player has a chance to get the secret room on any level) Disables the accidental appearance of the store. (Deleted due to appearance. Stores must now be similar to the levels in which they are located) Global_xp_award_percent: 100 > 50 (Made to complicate the game. In most cases, a player reaching the maze is no longer killed and can absorb damage without armor) Player_share_minimap_progress: true (Activated for testing) Player_speed_weight_impact_percent: 100 > 130 (It's made for balance. But unfortunately, it will not work at the last stages of the game. Ideally, classes that do not have the strength boost will not be able to wear heavy armor and a lot of things at the same time) Player_speed_max: 18.0 > 15.0 (There are no enemies in the game that can react to a player with 18 speed. Ninjas and robbers won't get any discomfort from the game if they stick to their roles) ==================================================================== After installation, you need to unzip custom content into the game if you want working custom levels, music, models: - Subscribe to the mod - Go to the Workshop directory ...\\Steam\\steamapps\\workshop\\content\\371970\\1928863533\\Custom_assets - Copy all of the files and folders - Go to the Barony directory ...\\Steam\\steamapps\\common\\Barony - Paste all the files there If you can't install it, try to check it on video. https://youtu.be/zP1VazvVpqs I added a folder with a preview of all the rooms I made, if you need to find a specific room. ==================================================================== What is in mods: Mine 300 rooms Garden 35 rooms Newmine 27 rooms Crypt 50 rooms Deep mines 124 rooms Swamp 184 rooms Ancienttown 22 rooms Labyrinth 254 rooms Ruins 338 rooms + level \"Old garden\" Custom track: Chris Kukla - Old Home There's nothing beautiful left of this place. The wind penetrates empty houses or destroyed ruins, and marauders search the streets. + level \"Deep mines\" After the collapse of the mountain, the miners were doomed to starve to death. Anyone who decides to find out what is hidden in the depths of the mine awaits inevitable death. + secretlevel \"Mine Arena\" Fight in the arena and gain invaluable experience! The roar of the crowd demands spectacle and blood! Custom track: Overlord - Soundtrack Combat Boombastic + secretlevel \"Shelter Walter and Bine\" + secretlevel \"Mine Town hub\" (+1 level) Random choice mine towns. + secretlevel \"Gnomish mines hub\" (+2 level) Random choice gnomish mines. + secretlevel \"Sokoban hub\" (+3 level) Random choice sokoban. + secretlevel \"Newmine\" Custom track: Overlord - Soundtrack 38 Wither Dig your way, but be afraid of competitors. Dwarves do not want to give their possessions without a fight! + level \"Crypt\" Light does not enter here and darkness always reigns. Hordes of skeletons scour the rooms waiting in the wings. Sealed crypts and bloody altars begin to spread damage around them again. Custom track: Diablo 2 - Spider + secretlevel \"Ancient town\" Custom track: need suggestions for the soundtrack book 5 Tiles 106 sound 6 music 8 models 11 What files are used: 1)Workshop -data ==gameplaymodifiers.json ==monstercurve.json -books -images ==tiles.txt -maps ==levels.txt ==secretlevels.txt -preview.png -music ==intermission.ogg 2)Additional root files that cannot work through the mod -sound ==sounds.txt -models ==models.txt There is no way to control RNG things at user levels. The player can get things from the end of the game. No ability to add custom music. Used method via SOUND_SPRITE (music will be in sound channel). So far workshop can't see custom files in sounds, models folders. So you have to unpack the files via Custom_assets. ", "time_created": 1575535803, "time_updated": 1606322801, "views": 7606, "favorited": 201, "tags": ["dungeons", "v3.2.3", "v3.3.0", "v3.3.1", "v3.3.2", "v3.3.3", "v3.3.4", "v3.3.5", "v3.3.6", "v3.3.7"], "votes": {"up": 92, "down": 1}}, {"id": "1649360178", "title": "Runescape Music Replacement", "file_size": 150530443, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/947348317619226915/42131B0C7EA4CE751A244EA36F3FCEE00EFB665A/", "description": "This mod replaces pretty much all the music files. The Old School Runescape music soundtrack is used for this mod. I haven't updated the mod since I first published it, so I'm not sure if they have added any new music to Barony. I don't plan to really update this mod, however if there are some issues, please let me know, and I might fix it.", "time_created": 1549676351, "time_updated": 1549676351, "views": 4194, "favorited": 81, "tags": ["audio", "v3.2.2"], "votes": {"up": 63, "down": 1}}, {"id": "1383277228", "title": "Roblox death sound - OOF!", "file_size": 4500942, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/995744120763190907/9CE84B98780FDD2833611BF01A6A7EA0A9492136/", "description": "Replaces all deaths with remixed versions of OOF :^) Will increase your OOF-level by at least 20% or you can unsubscribe for free! Works for multiplayer Changes: - Most death/break sounds --DISCLAIMER: I do not own any of the content which is used for entertainment purposes-- ©2018 Roblox Corporation", "time_created": 1526053238, "time_updated": 1533096343, "views": 6145, "favorited": 77, "tags": ["audio", "v3.1.6", "v3.1.7"], "votes": {"up": 89, "down": 9}}, {"id": "1682566240", "title": "WitchFox's Miscellaneous Heads", "file_size": 32856, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/766107162748694866/C3C383E6D1E6EEF07A4FD84A5CB0CEDCED137A33/", "description": "Take on Baron Herx in style! (MULTIPLAYER COMPATIBLE) This mod replaces certain heads in barony, once you load up the mod, choose a male character. currently replaces: ----------------------------- Version 1.0 Claymount = Wolf Stormward = Chicken Tradefall = Cat Nightfall = Alligator ----------------------------- Version 1.1 Baytower = Owl Whetsong = Orc ----------------------------- Version 1.2 Millbound = Axolotl Northbound = Elf ----------------------------- Version 1.3 Fox = Highwatch The Mini-taur = Windclan ----------------------------- Version 1.4 Bunny = Hardbred Racoon = Pyrebloom ----------------------------- Version 1.5 Dragon = Snakestone Myconid = Sunstalk ----------------------------------------------------------------------------- RESUBSCRIBE IF ANY UPDATES ARE NOT WORKING! I will be updating this to have more content! Tell me what you guys think of it so far. Suggestions and criticism are welcomed. :) ", "time_created": 1552580730, "time_updated": 1576874889, "views": 4946, "favorited": 77, "tags": ["models  ", "misc", "gameplay", "v3.2.3"], "votes": {"up": 63, "down": 0}}, {"id": "1488782892", "title": "Benny Hill - Minotaur soundtrack (Yakety Sax)", "file_size": 3098649, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/968724911468835448/F7C44370C77F339EE95B3C04F7FB13FDFC019090/", "description": "This will change the music when the Minotaur spawns to the Benny Hill chasing theme :^) The mod will increase the adrenaline rush with 20%, or else you will get to unsubscribe for free! The mod has been re-uploaded as it wasn't avalible until the v.3.2.0 update due to bugs in the game --DISCLAIMER: I do not own any of the content (music) which is used for entertainment purposes", "time_created": 1534934969, "time_updated": 1534934969, "views": 4069, "favorited": 81, "tags": ["audio", "v3.2.0"], "votes": {"up": 67, "down": 4}}, {"id": "1652500778", "title": "Aeuhh Mod", "file_size": 30281141, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/947348594928818881/954B3A4265C58C1295618F05E4864B0BAE4511E6/", "description": "Tim Allen invades Barony Mod changes: ♥ all textures of all solid surfaces to Tim Allen's face ♥ menu and death music to Home Improvement themes ♥ creature and other entities names ♥ some messages and other text in inventory AEUUHH?! I honestly don't know what am I doing with my life. Send help.", "time_created": 1549892310, "time_updated": 1549895476, "views": 3706, "favorited": 59, "tags": ["audio", "misc", "gameplay", "textures", "v3.2.2"], "votes": {"up": 67, "down": 10}}, {"id": "1680667849", "title": "Seinfeld on Death", "file_size": 869295, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1000268607553313925/B2624E43D9556F8BF65968412311207B32E0F252/", "description": "Replaces the death fanfare with the Seinfeld theme song. Made while figuring out the Steam Workshop, I made the mod public in case anyone else wants to smile after another inevitable Barony death. DISCLAIMER: I do not own any of the content in this mod, and it is for entertainment purposes only.", "time_created": 1552371759, "time_updated": 1552371949, "views": 3539, "favorited": 61, "tags": ["audio", "v3.2.3"], "votes": {"up": 50, "down": 3}}, {"id": "1528817423", "title": "Roblox Boulder", "file_size": 985311, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/966476706444630081/0814D199FA0507BDD04F8F7629A51552FDD0DF1E/", "description": "If the gray boulder isn't for you, now you finally get a yellow screaming one Works for multiplayer Changes: * models\\decorations\\boulder.vox * sound\\Boulder.ogg * sound\\BoulderCrunch.ogg * sound\\BoulderRoll.ogg * sound\\BoulderThump.ogg --DISCLAIMER: I do NOT own any of the content, all contents belongs to their rightful owners--", "time_created": 1538509894, "time_updated": 1538509894, "views": 3058, "favorited": 41, "tags": ["models  ", "audio", "v3.2.2"], "votes": {"up": 46, "down": 2}}, {"id": "1394336238", "title": "Deadly Descent (W.i.P)", "file_size": 348655, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/927058790422066826/97770999796AD660F68937C609147809D17247E8/", "description": "Brave the depths of the Forgotten Ruins. DeadlyDescent is a mod that aims to provide more levels to play in Barony, separate from the main game. The levels are hand-made and are made up of different level themes, with the levels varying in size and difficulty. I have added 6 new levels so far, and a new hub area New levels - Sewers1, Sewers2, Sewers3. ForsakenDepths1, ForsakenDepths2, Gnomish Prison1 New hubs - OvergrownRuins I also recoloured the Rat to make them look a bit... eviler?", "time_created": 1527268635, "time_updated": 1527510797, "views": 4947, "favorited": 55, "tags": ["models  ", "dungeons", "v3.1.6"], "votes": {"up": 45, "down": 3}}, {"id": "2342587753", "title": "Crabs Adorbs - Spider Replacer", "file_size": 664489, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1667986984463745223/4420158F6FC7E1173DB762F912F5C28AE7F7E287/", "description": "Replace spiders with crabs! Do you have arachnophobia? Do Barony's spiders prevent you from being able to enjoy the game? Turning Wheel created this mod just for you! It replaces the spider sounds with less intimidating bubbly crab vocals. What's not to love? Note some in-game text will still say \"spider\", but what are you going to believe, some text or your own eyes? That's clearly a crab! Crabs will also still sometimes give you an infection upon pinching you (poison). Shamans now also have Crab forms instead of Spider forms. Their \"Spray Web\" spell has now been turned into \"Spit Bubbles.\" ADORABLE! If you would like to play Barony with others using this mod, they can either subscribe and load it just like you, or you can replace the game's default spider and sound assets with those found within the mod. It's aesthetic only, so it won't effect achievements or cause de-syncs in multiplayer!", "time_created": 1609366905, "time_updated": 1619490651, "views": 1356, "favorited": 30, "tags": ["models  ", "audio", "textures", "v3.3.7"], "votes": {"up": 34, "down": 0}}, {"id": "1684565175", "title": "Minotaur Ed", "file_size": 1546606, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1002520615735282966/2002FEE8D03C055451D5BD560716BB2898050C5B/", "description": "Changes the Minotaur music to Ed running and laughing. Now you can smile and laugh along at your impending doom! Sound source: https://www.youtube.com/watch?v=kd39bFPonD4", "time_created": 1552749417, "time_updated": 1552749417, "views": 3122, "favorited": 36, "tags": ["audio", "v3.2.3"], "votes": {"up": 38, "down": 3}}, {"id": "1488784471", "title": "Minecraft villager shopkeeper", "file_size": 3334718, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/968724911468844062/C0D8041D1CD24CBD40FBDCE4B2DB59577437AFCD/", "description": "This will replace the bald shopkeeper - to another bald shopkeeper Works for multiplayer Changes: * images\\system\\shopkeeper.png * images\\tiles\\Shelf.png & shopsign.png * models\\creatures\\shopkeeper * music\\shop.ogg * sound\\buy.ogg The mod is a re-upload as this mod wasn't avalible until the v.3.1.8 update due to bugs in the game --DISCLAIMER: I do NOT own any of the content, all contents belongs to their rightful owners-- Model/textures recreated/modified with insperation of/by \"Minecraft\" made by Mojang© & Microsoft© Song is called \"Sweden\" and from \"C418\"", "time_created": 1534935129, "time_updated": 1538511315, "views": 2532, "favorited": 38, "tags": ["models  ", "audio", "textures", "v3.2.0", "v3.2.2"], "votes": {"up": 35, "down": 2}}, {"id": "1751680613", "title": "Alt Spell Icons", "file_size": 1089796, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1550884775772522664/E95344135BAA32FAE10B23BE53D0F781532E7D08/", "description": "Replace current Spell icons, with new ones. Those are made to give each spell a more unique feel. _______________________ There are also four borders representing each spell function: Red: Destructive Fireball, cold, forcebolt, etc. Yellow: Debuffs Sleep, Stoneblood, confuse, etc. Blue: Utility Dig, Healing, indetify, etc. Green: Buffs(toggle on/off) light, levitation, invisible, etc. _______________________ Have fun!", "time_created": 1558813678, "time_updated": 1601159047, "views": 2031, "favorited": 27, "tags": ["misc", "textures", "v3.2.3", "v3.3.3"], "votes": {"up": 30, "down": 0}}, {"id": "1404654539", "title": "Rise of the Dovahkiin (WIP)", "file_size": 504622, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/920304477972283386/504DD133509F7C916B5263C4C79146E8F3EAEAAF/", "description": "Wait no longer, be the dragonborn! This mod brings a bit of Skyrim into Barony by replacing certain looks and sounds. At the start of the game the player can equip him/herself like a true dovah, including a (forcebolt) shout! The mod still has some updates to undergo like changing the item icons (which currently isn't possible because of the engine) and replacing more content with Skyrim references. Feedback is always welcome! ", "time_created": 1528324464, "time_updated": 1528324464, "views": 5509, "favorited": 46, "tags": ["models  ", "audio", "misc", "textures", "v3.1.6"], "votes": {"up": 33, "down": 2}}, {"id": "1618392897", "title": "You've been gnomed", "file_size": 553089, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/951849041919808241/FD188B12B7DD559A29A2416358425D863BD6F949/", "description": "You can get gnomed. Its that simple :0 my first barony mod btw Changes made: Language file, Gnome sounds.", "time_created": 1546919026, "time_updated": 1546979163, "views": 3647, "favorited": 31, "tags": ["audio", "misc", "v3.2.2"], "votes": {"up": 32, "down": 5}}, {"id": "1528960637", "title": "Resident Evil 4 Overhaul/Audio Replacer v0.2", "file_size": 13779394, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/943959157649205700/60D6B45C9CAC87C3D0444C3139B9D3A48863D4EE/", "description": "Hello fellow dungeon runners. I thought the workshop needed some more content. I present to you: The Resident Evil 4 Overhaul - The Super Ultra Mega Early Edition. (But for now we'll call it the Resident Evil 4 Audio Replacer since that's all it does.) >>This mod is *Very early*. Please read the notes at the bottom of the textbox.<< >>What it currently does<< 1. Replaces \"Intermission\" (Music that plays in tileset transitions and the starting map) With RE4's \"Serenity\" (Plays when Leon reaches specific safe spots.) 2. Replaces the Shopkeeper theme (referred to in the game files as Shop.ogg) with the Save Theme/Typewriter theme. 3. Adds unique music that plays when the player enters the Gnomish Mines. Track: RE4 OST \"Infiltration\" (Which I believe plays when Leon fights the cultist in red that eventually mounts a gatling gun.) 4. Replaces the death sound with the one from RE4. 5. Mixes the normal buzzer sound that plays when the player attempts to buy an item that they cannot afford with \"Not enough cash, stranger.\" 6. Replaces the sound that plays whenever the player buys/sells an item with \"Heheheh.. Thank you.\" >>Planned Features<< Changing the races to look like RE4 characters with the help of VoxelShop. One of the races (referred to as FemaleFaceMed4 in the game files) already looks really similar to Ada Wong's face so as long as i get the hang of making changing the skin color/adding color variants to prevent it from all being one color we'll be golden. Changing all the gems to look like the Spinel, Velvet blue (might have to make the model slightly larger in order to match the amount of detail), Ruby, and so on. Changing the item pickup noise to match the ones from RE4. Barony has separate sounds that play for gold pickups - which is great because RE4 also has a gold (or PTAS) pickup sound which i think will fit without feeling too out of place. Make some sort of makeshift RE4 Merchant model using the hood model that is already in the game. >>Considered Features/Joke Features<< Complete Music/Ambience overhaul Change the Gnome sounds to the Cultist's chanting sounds. I feel like this'll fit rather nice with the stressful setting. Changing the Succubus' sounds to match Ashley's voicelines (because the Succubus wasn't loud and annoying enough already. Let's make it even worse. lol.) --------------------------------------------------------------------------------------------------------------------------------------- I don't own the PC version of RE4 (i play on an emulator) so i don't have access to all of the files yet. I'll probably buy it soon if i get the money. As of right now, I'm somewhat experienced in image editing and video editing. (and i'm able to do some pretty basic stuff to the audio) Now, video editing is kind of irrelevant to this project but i guess some sort of trailer/update video wouldn't hurt. If anyone is experienced in voxel modelling/pixel art, I want to encourage you to leave suggestions or if you're interested in participating in the project shoot me a message and we'll talk. >>>>Feedback and suggestions are more than welcome!!<<<< >>Version 0.2 notes!!<< Added a video to demonstrate the changes so that you don't have to spend time doing that yourself. The sounds/music is a bit louder and should now blend in a lot better with Barony's loud-ass sounds ; ) I got myself an audio editing software! All of the silence previously present in sounds/music should now be fixed.", "time_created": 1538523414, "time_updated": 1538686493, "views": 6144, "favorited": 45, "tags": ["audio", "v3.2.2"], "votes": {"up": 34, "down": 0}}, {"id": "1667948479", "title": "Actually Scary Minotaur", "file_size": 23820, "preview_url": "", "description": "Makes the minotaur look like they've actually been smashing people into paste their whole life. Remodeled their hammer to look like it'd give you some HIV and/or tetanus if it was even inches from you, and decorated their face with bling and a few well-deserved injuries. Apologies for the lack of a thumbnail, but I suffer from crippling shlacker shindrome.", "time_created": 1551241253, "time_updated": 1551241253, "views": 2136, "favorited": 14, "tags": ["models  ", "v3.2.3"], "votes": {"up": 24, "down": 0}}, {"id": "2287032007", "title": "Global Exp Share", "file_size": 2098, "preview_url": "", "description": "Shares experience among all player characters regardless of how far away they are. Also enables shared map visibility, which will reveal areas on the mini-map that your teammates explore while they hold a source of light. ", "time_created": 1605372125, "time_updated": 1605372125, "views": 1580, "favorited": 43, "tags": ["gameplay", "misc", "v3.3.7"], "votes": {"up": 25, "down": 1}}, {"id": "2424373345", "title": "RNG of the Irish", "file_size": 1276719, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1768198819557124609/38B6F8A843E5305DE5486A901C50415A94FF50D9/", "description": "Celebrate Saint Patrick's Day with Turning Wheel's official RNG of the Irish St. Patrick's Day mod. RNG of the Irish puts an emphasis on aspects of Irish culture to celebrate St. Patrick's Day, including: Classic and modern Irish food, like corned beef, soda bread and cabbage, plus a few surprises An emphasis on brewing, with text and art that adds some lighthearted fun to alchemy Fashion changes to headwear, including flatcaps and lucky green top hats Lucky green accessories and equipment, sparing you from excessive pinches Cosmetic changes, adding shamrocks and pots of gold etc. for festivity Gnomes have been replaced with Leprechaun tricksters, with new VO from our audio champion Chris Kukla RNG of the Irish doesn't modify any gameplay and is a purely cosmetic mod. This means you can enjoy it without invalidating achievements, or causing desyncs in multiplayer. Happy Saint Patrick's Day!", "time_created": 1615711508, "time_updated": 1616051580, "views": 1526, "favorited": 35, "tags": ["models  ", "audio", "textures", "v3.3.7"], "votes": {"up": 34, "down": 0}}, {"id": "1357807830", "title": "WOJ's Start With Ring of Slow Digestion Mod", "file_size": 268850, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/912418010562233224/60A442BC41AB5B608C3611D350595DDCC38B5708/", "description": "This mod spawns 4 rings of slow digestion for players in the start.lmp map. Compatible with multiplayer (All clients need the mod installed.)", "time_created": 1523372234, "time_updated": 1523373918, "views": 3783, "favorited": 41, "tags": ["dungeons", "gameplay", "v3.1.3"], "votes": {"up": 25, "down": 1}}, {"id": "1384431880", "title": "Super Mario Thwomp Boulder", "file_size": 418128, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/967595685945359932/66263F801830F9489BB50EC85E02DF43FDE64470/", "description": "Replaces the boulder with the Thwomp in Super Mario Works for multiplayer Changes: models\\decorations\\boulder.vox sound\\BoulderCrunch.ogg sound\\BoulderThump.ogg --DISCLAIMER: I do not own any of the content which is used for entertainment purposes--", "time_created": 1526155506, "time_updated": 1531505639, "views": 2670, "favorited": 25, "tags": ["models  ", "audio", "v3.1.6", "v3.1.7"], "votes": {"up": 24, "down": 1}}, {"id": "2032324849", "title": "Pwn25's Extravagant Weapons Texture Pack", "file_size": 774809, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/777374655664831215/C4AEC383DF098744603952EABB5970EBED440ACC/", "description": "This is a mod that changes the appearance of almost every single weapon in the game. The alterations on each weapon varies between small tweaks and recolors to full blown remodels and recreations of the weapons. In total I made skins for 31 of the weapons in the game as follows... - Bronze Sword - Iron Sword - Steel Sword - Crystal Sword - Dyrnwyn - Bronze Axe - Iron Axe - Steel Axe - Crystal Axe - Parashu - Bronze Mace - Iron Mace - Steel Mace - Crystal Mace - Sharur - Quarter Staff - Iron Spear - Steel Halberd - Crystal Spear - Gungnir - Sling - Shortbow - Longbow - Compound Bow - Khryselakatos - Crossbow - Heavy Crossbow - Bronze Tomahawk - Iron Dagger - Steel Chakram - Crystal Shuriken This mod only affects the appearance of weapons, so therefore, it is multiplayer compatible. I spent quite some time making these weapon skins and I am quite please with how they turned out. I have had so much fun using these weapon skins during testing and now it is your turn to enjoy them too.", "time_created": 1584957980, "time_updated": 1608266670, "views": 2195, "favorited": 39, "tags": ["textures", "v3.3.2", "models  ", "v3.3.7"], "votes": {"up": 25, "down": 1}}, {"id": "1449003866", "title": "Barony Vanilla Texturepack [\"WIP\"]", "file_size": 442761, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/947330279861168399/3BB38A77C7144E59B8CE56EA145418199D342FF1/", "description": "On September 2015, all the art for the game, including models, got a rework by the developer Josiah (aka Mistersneak) which is still used to this day. The art update was included in the free DLC \"Barony - Cursed Edition\" This is the vanilla textures made by X which was the first textures used in-game NOTE: * Will change all textures resolution from 32x to 16x16 pixels * Missing animated tiles * Some maps have been altered to reflect the newer textures * Tiles added after the Cursed DLC have been downscaled and modified to fit the original The vanilla tiles that are missing can be found in the mods game files within; Textures\\images\\tiles\\\"NOT MODIFIED.txt\"", "time_created": 1532385190, "time_updated": 1532385190, "views": 3521, "favorited": 24, "tags": ["textures", "v3.1.7"], "votes": {"up": 22, "down": 0}}, {"id": "2474260521", "title": "Baronfall", "file_size": 42751994, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1791847117441212064/5B19AE7FF6665801FD7293468BD2922CD4150A98/", "description": "Barony was in many ways inspired by the Bethesda classic \"The Elder Scrolls II: Daggerfall\". From the first-person, VGA aesthetic, high fantasy world, to the level-by-use skill system, Barony and Daggerfall fans share a pretty big spot in their venn diagram. This mod seeks to echo some nostalgia from Daggerfall into Barony by swapping in sound effects and music where it fits in. In making this mod I attempted to capture some of the most memorable and nostalgic songs and sounds from Daggerfall. So while Daggerfall's dungeons usually featured more ambient tracks, I selected songs that were more memorable for fans of Bethesda's game. These two games share common creatures and mechanics, and I've done my best to select sounds as overt references. While the video for the mod only shows gameplay from the mines, sounds and music have been uniquely replaced across the entire game. Is something missing or did I miss a key piece of nostalgia? Please let me know in the comments! I hope you enjoy this mod.", "time_created": 1619940390, "time_updated": 1619940390, "views": 2411, "favorited": 23, "tags": ["audio", "v3.3.7"], "votes": {"up": 22, "down": 1}}, {"id": "1682348432", "title": "Final Fantasy Sounds (Retro)", "file_size": 96453756, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/996891115114730617/96F84668289C745E9759225A1626C9BC263C17DC/", "description": "Sounds and music from the Final Fantasy NES/Famicom games (Specifically I, II and III, with a few extra surprises)! ============================================================ caves00: Those Who Fight - VII Remix caves01: Dungeon - III caves02: Castle of Hein - III citadel00: Mini Boss - I Remix citadel01: Temple of Chaos - I citadel02: Undersea Shrine - I devil: This is the Last Battle (3) - III escape: Hazardous Short Music 2 - III hell00: This is the Last Battle (2) - III hell01: Floating Castle - I hell02: Crystal Tower - III herxboss: Battle 2 - II intro01: Prelude - III intro02: Prelude - I introduction: Opening Theme - III labyrinth00: Battle Scene 1 - II labyrinth01: Magician's Tower - II labyrinth02: Dungeon - II library: Village of the Ancients - III mines00: Battle Scene - I mines01: Crystal Cave - III mines02: Dungeon - I mines03: Let Me Know the Truth - III mines04: Matoya's Cave - I minetown: Village Theme - II minotaur00: Hazardous Short Music 1 - III minotaur01: Hazardous Short Music 3 - III ruins00: Battle Scene 3 (Unused) - II ruins01: Imperial Army Theme - II ruins02: Ancient Castle - II sanctum: Crystal Room - III shop: Shop - I splash: Garuda Defeat - III swamp00: Battle 1 - III swamp01: Beneath the Horizon - III swamp02: Jinn the Fire - III swamp03: Living Forest - III temple: Dungeon (Unused) - II underworld00: Fiend Boss - I Remix underworld01: The Dark Crystals - III underworld02: Forbidden Land Eureka - III", "time_created": 1552558869, "time_updated": 1575145402, "views": 1515, "favorited": 37, "tags": ["audio", "v3.2.3", "v3.2.4"], "votes": {"up": 22, "down": 0}}, {"id": "1412523525", "title": "A Shrek-tacular model", "file_size": 12187, "preview_url": "", "description": "All trolls are now Shrek. Nothing more is attached to this, but I hope to get sound files on the way for common shreck lines. I also have a multitude of item changes and shreck themed items, such as Donkey, onions, and a few more characters, in development. ", "time_created": 1529078358, "time_updated": 1529078358, "views": 2305, "favorited": 15, "tags": ["models  ", "v3.1.6"], "votes": {"up": 20, "down": 0}}, {"id": "2452042179", "title": "Ultrakill V1 Automaton model", "file_size": 104526, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1801978208011610264/731F3C17C273008C740919167777C9BC15C9ABC6/", "description": "Humanity is dead Blood is fuel Hell is full have as much fun playing as V1 as I had making this model, also try the ultrakill demo on steam.", "time_created": 1618014122, "time_updated": 1618077520, "views": 1018, "favorited": 16, "tags": ["v3.3.7", "models  "], "votes": {"up": 20, "down": 0}}, {"id": "2192998994", "title": "BigBarony", "file_size": 1159515, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1479948835345136313/592995820D25FC2201F6131ACEABBB540146748E/", "description": "maps are 4x bigger than normal. This mod is not required overwrite files. Does not affect secret maps, custom maps and maps of place to rest. ---BiggerMaps--- -caves -citadel -hell -labyrinth -mine -ruins -swamp -underworld Changes: -\"global_xp_award_percent\": 100 -> 50 -\"global_gold_drop_scale_percent\": 100 -> 50 if you don't wanna change scales, go to ...\\Steam\\steamapps\\workshop\\content\\371970\\2192998994\\data and remove gameplaymodifiers.json.", "time_created": 1597041781, "time_updated": 1597094142, "views": 1932, "favorited": 47, "tags": ["dungeons", "gameplay", "v3.3.6"], "votes": {"up": 24, "down": 3}}, {"id": "2157846993", "title": "Zelda OOT music replacement", "file_size": 109881812, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1302053624123028946/93C4184D4AB87C06276D1B47933B0FE85819FAFF/", "description": "Replaces all the music of the game and a few sound effects with music from Zelda Ocarina of Time, and some from Majora's mask. All of those wonderful tracks were written by Koji Kondo. full music list: intro - Fairy fountain intermission - Deku tree mines - Dodongo's cavern shop - Shop swamp - Forest temple labyrinth - Spirit temple ruins - Ganon's castle underground caves - Ice cavern citadel - Great bay temple (Majora's) hell - Fire temple underworld - Shadow temple minetown - Goron city library - Deku tree temple - Woodfall temple minotaur - Middle fights herxboss - Ganondorf fight sanctum - Majora mask boss battle devil - Ganon fight escape - Escape from ganon's castle endgame - Credit roll splash - Gameboy splash screen", "time_created": 1594149164, "time_updated": 1594149164, "views": 1078, "favorited": 48, "tags": ["v3.3.4"], "votes": {"up": 19, "down": 0}}, {"id": "1384935436", "title": "Keemstar Gnomes [EXPLICIT LANGUAGE]", "file_size": 1127262, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/970977997477324622/68E8221B8B2D90267E16F30284A0E75543CE7284/", "description": "Replaces all Gnomes with our favorite one - Keemstar We are bringing the drama to Barony! Changes: Language file (3.4.4), Gnome sounds, Gnome model, Yellow staff model --DISCLAIMER: I do not own Keemstar which is used for entertainment purposes, no bullying--", "time_created": 1526206611, "time_updated": 1595784472, "views": 4485, "favorited": 39, "tags": ["models  ", "audio", "misc", "v3.1.6", "v3.1.7", "v3.2.1", "v3.2.2", "v3.3.4"], "votes": {"up": 45, "down": 19}}, {"id": "1401042102", "title": "Goose Sounds", "file_size": 228414, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/933814907381792793/B8B60C0DB39CA73AB1EBC50DDE3468A4F4A0793B/", "description": "For my 1st mod I replaced all those annoying spider sounds with equally annoying geese sounds.", "time_created": 1527958219, "time_updated": 1527958219, "views": 1796, "favorited": 17, "tags": ["audio", "v3.1.6"], "votes": {"up": 21, "down": 2}}, {"id": "2183544742", "title": "Sheep Spider Replacement", "file_size": 460359, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1470940803734745785/56B69E70F5B90B706BB63A2609F8CF4DE2BEA4FB/", "description": "Are you scared of spiders? Do you wish they just didn't exist at all? Well, we can't simply just wipe them off the face of the earth. Here at Aperture Science, we just injected some spiders with sheep DNA, and let them loose. Proven to be 53% less scary than regular spiders, trust me. You're welcome. Cave Johnson, we're done here. This mod replaces the Spider model to whatever this thing is. Spider sound files were also changed. (The first video was made before I had added the sound files.) ", "time_created": 1596223370, "time_updated": 1596241758, "views": 1591, "favorited": 21, "tags": ["models  ", "v3.3.5", "audio"], "votes": {"up": 21, "down": 1}}, {"id": "1387678409", "title": "The Additional Items Mod", "file_size": 2625519, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/934940807283944339/B70101D7D5DF9212858B0416896DA1DD083B76E8/", "description": "IMPORTANT: Any updates to the Barony main game or this mod require you to redo steps #1-4. -------------------------------------------------UPDATED FOR 3.2.2---------------------------------------------------- --------------------------------NOT TESTED WITH MYTHS & OUTCASTS DLC ------------------------------- Added: Scroll of Equipment Potion of Fire Breathing Potion of Sturdiness Scroll of War Scroll of Lullaby Frostbow Firebow Noisy Cricket Dodge Roll Iron Warhammer Compliant Rod Updated: All bow based ranged combat Blank Scroll INSTALL INSTRUCTION: Do everytime there is an update. ------------------------CRITICAL THAT YOU DO THESE OR IT WILL NOT WORK---------------------------- Optional- Make a back up of your Barony.exe file found by right clicking Barony->Properties->Local Files->Browse Local Files.. 1. Navigate to the steam workshop directory in C:\\Program Files (x86)\\Steam\\steamapps\\workshop\\content\\371970\\1387678409 2. Copy all of the files and folders. 3. Navigate to the steam Barony directory in C:\\Program Files (x86)\\Steam\\steamapps\\common\\Barony. 4. Paste all the files and folders. When it asks you if you want to Copy and Replace files and folders hit yes. 5. Have fun Notes: -Works in multiplayer if all players have downloaded and done the above instructions. -Incompatible with players that do not have this mod installed. -The easiest way to revert back to the original game is to verify game cache under the properties when you right click the game. -Won't work with other mods that require similar steps as above. -Not tested with the map editor. -See the source code additions at https://github.com/luustephen/Barony -If you find bugs in the game or have suggestions for additions make sure to let us know. Known bugs: Firing multiple arrows when going down a floor will crash the game. If the game crashes on bootup, it's likely that the barony.exe was replaced with the original, you have to go do step #1, copy barony.exe, and do step #3 and #4. Unless there is a large response for updating this mod alongside the game, it will likely remain at the 3.2.2 patch without constant updates.", "time_created": 1526529840, "time_updated": 1549508452, "views": 3880, "favorited": 33, "tags": ["gameplay", "v3.1.6", "v3.1.7", "v3.2.1", "v3.2.2"], "votes": {"up": 20, "down": 0}}, {"id": "2411314845", "title": "Fancy Cursor and Reticle", "file_size": 16919, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1771575300037673947/C92263F03476E7BAEA9E9A8BD3EC989AEE9BF576/", "description": "Replaces the cursor with fancy versions. Reticle should now be easier to see on light and dark backgrounds.", "time_created": 1614567192, "time_updated": 1614567192, "views": 928, "favorited": 28, "tags": ["v3.3.7"], "votes": {"up": 18, "down": 0}}, {"id": "1678479748", "title": "Actually Scary Undead", "file_size": 174372, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/993512944595948698/7CC9A0CF998DD1A69041EDDA565C641FF7858223/", "description": "Like the mod I created to make the minotaur look less goofy, but now with undead (by definition) stuff. Ghouls are a lot more like corpses that have been rotting underground for at least long enough to have severe necrosis set in, Baron Herx adorns a much less cartoony palette with a duller red and whiter gold, Orpheus could probably sell just his helmet for a flat 100 billion gold, and Erudyce has blue eyes now (which is why she's banned from the \"I'm in the mod's pictures\" club). Just don't pay attention to the fact that making the liches look cooler doesn't mean they're scarier.", "time_created": 1552183268, "time_updated": 1552183268, "views": 2613, "favorited": 26, "tags": ["models  ", "v3.2.3"], "votes": {"up": 18, "down": 1}}, {"id": "1845646529", "title": "Shop Signs", "file_size": 353560, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/776229524656557542/C0E93C640D816ECB6E8ECFE234456E5931DD0D57/", "description": "This mod redesigns the current shops by adding signs in front of them, so now you can see what type of shop it is that you've stumbled upon without needing to enter. No more waiting for your friends to stop squabbling with the merchant! No more monsters squandering polymorph potions to mistakenly sell valuable gems to pastry shops! NOTE: This mod affects map properties, so it will disable achievements. It's been a long time coming, but I've finally got around to adding the actual signs to the shops. You now read the signs by right-clicking on the sign model. I've also modified Minetown a bit, establishing static shops as opposed to random ones and changing a few aspects of the map itself. Due to the lack of variable assignment in the editor, this was rather complicated and time consuming to make, so please let me know if I've made any mistakes and I'll correct them immediately.", "time_created": 1566787715, "time_updated": 1599329469, "views": 1538, "favorited": 23, "tags": ["misc", "gameplay", "v3.2.3", "v3.3.2", "dungeons", "v3.3.7"], "votes": {"up": 17, "down": 1}}, {"id": "1972820294", "title": "Scrapped Maps from Development", "file_size": 741659, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/778494625524475551/A7D513D1E11EB6045B54D7ACE65F9C4B29548C9F/", "description": "Rejects from the dev process! This mod contains tons of levels that were scrapped during the development of Barony. Many of the levels were removed because they were only ever intended for testing purposes, although others were replaced or taken out because they just didn't work out as intended. I rediscovered these levels rotting away on my hard-drive today, and because I had forgotten that they ever existed, I gave them all a try and decided they were too interesting to risk getting lost forever. So here they are - just as they were when I last touched them over five years ago. As a bonus, I've written some text commentary for every map in the mod, so you can better understand what the context was when I made them: https://pastebin.com/raw/hND2zrTw (NOTE: Very few of the maps included in this mod have proper exits. Therefore, you will need to use the /nextlevel command to advance in most situations. Enjoy!)", "time_created": 1579398826, "time_updated": 1579402970, "views": 1130, "favorited": 17, "tags": ["dungeons", "gameplay", "v3.3.1"], "votes": {"up": 15, "down": 0}}, {"id": "1684791049", "title": "Actually Scary Skeletons", "file_size": 147119, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1000269051197271930/428C6ECA5E56896982985EFA34547A209F7BCE80/", "description": "Because a guy asked for it. Makes the skeletons a sickly greenish hue and adds chunks of flesh that haven't rotted off quite yet. Also gives them turquoise glowy eyes a bit back in their head, in case you were disappointed with the definitely existent lack of glowy eyes on mostly every monster in the game. Skeleton race included. Also gives Parashu a redesign that somebody might think is better than the original. I'd make a \"spooky scary skeletons\" joke, but I already made a Doom revenant joke with the thumbnail, so I'm already out of actually funny funnies.", "time_created": 1552760740, "time_updated": 1552760740, "views": 3106, "favorited": 13, "tags": ["models  ", "v3.2.3"], "votes": {"up": 14, "down": 0}}, {"id": "1385674829", "title": "Mural Legitimacy Project", "file_size": 366648, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/933813165414948817/BA4111C9E859559EDA1FB90B460298E3F67B6D8F/", "description": "Legitimizes equine murals using a Frazetta classic Artwork is property of its rightful owner", "time_created": 1526271614, "time_updated": 1526273789, "views": 1450, "favorited": 10, "tags": ["textures", "v3.1.6"], "votes": {"up": 16, "down": 1}}, {"id": "2370938004", "title": "Lunar Celebration - Year of the Ox", "file_size": 829981, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1774949637305889029/92C99054444728D7A6A75D927F9CB075F9050F4B/", "description": "Celebrate the Lunar New Year with Barony! This official Turning Wheel modification of Barony replaces Goatmen with Ox folk. Long horns, golden adornments and iconic pale flesh help you celebrate the Year of the Ox in 2021. Playable male and female goatmen are replaced with oxen, as well as goatman enemies, all looking like the beloved bovine. This cosmetic-only mod will not disrupt your ability to earn achievements. Note that text will still refer to these characters as \"goatmen\".", "time_created": 1611393195, "time_updated": 1611427695, "views": 577, "favorited": 21, "tags": ["models  ", "misc", "textures", "v3.3.7"], "votes": {"up": 15, "down": 0}}, {"id": "1875052438", "title": "Barony HD", "file_size": 148810098, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/773985684920291214/8E5D785E3C40B20BC72C2701EE77DC69BD3E03D9/", "description": "This is a reupload of an INCOMPLETE HD texture pack by p0ss from ModDB. Their words: I was inspired to start this mod after Barony was made open source. In that spirit, all assets used in this pack are GPL compatible, all source textures originated from opengameart.org and credits are included with the mod. The initial scope is to replace all environmental tiles, followed by items and interface elements. Eventually I may replace the 3d models, though that will take much longer and may require updating the game engine. Progress with current release: 80/155 tile images 0/75 sprite images 0/113 item images 0/51 system images This release is an initial proof of concept which alters 80/150 tile textures, changing them to 1024x1024px high res from 32x32px. Source textures are courtesy of opengameart.org and dozens of new textures were created for this mod. As this is a proof of concept, there are some slight tiling errors on some textures, and the rarer textures sometimes look out of place with each other. To install, simply copy the included directories into your barony directory, overwriting files when prompted. It is recommended that you create a backup of your barony directory prior to installing this mod. Some performance degradation could be encountered on older graphics cards due to the higher texture memory requirements.", "time_created": 1569689858, "time_updated": 1574279451, "views": 3209, "favorited": 18, "tags": ["textures", "v3.2.3"], "votes": {"up": 13, "down": 0}}, {"id": "1679689565", "title": "Final Fantasy Sounds", "file_size": 76378838, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/990135412901324450/59D4C879CA932F618C0DF384A5F0B5DD04267526/", "description": "Sounds and music from the Final Fantasy series! Art: https://www.deviantart.com/aikaxx/art/Chocobo-172746604 ============================================================ intermission: Djinn the Fire - III (Rebecca E. Tripp) herxboss: Battle Scene 2 - II (Dissdia) intro01: The Prelude - VII (FinalFanTim) introduction: Main Theme - XV labyrinth00: Battle 1 - II (Remix) labyrinth01: Sealed Away - V (Dracula9AntiChapel ) labyrinth02: Magician's Tower - II (Baroque Remix) mines00: Battle 1 - I (Orchestrated) mines01: Temple of Chaos - I (Remix) mines02: Dungeon - II (Dissidia 012) mines03: Into the Crystal Cave - III (PSP) mines04: Into the Darkness - IV (Rebecca E. Tripp) minetown: Mystic Mysidia - IV (Celtic Moon) ruins00: Let the Battles Begin! - VII (Pontus Hultgren) ruins01: Attack on Shinra ruins02: Mako Reactor - VII (Pontus Hultgren) shop: Shop - I (Rebecca E. Tripp) swamp00: Battle 1 - IX (BitSymphony) swamp01: Find Your Way - VIII (Orhypes) swamp02: Forested Temple - VII (Rebecca E. Tripp)", "time_created": 1552265738, "time_updated": 1552346216, "views": 829, "favorited": 17, "tags": ["audio", "v3.2.3"], "votes": {"up": 13, "down": 0}}, {"id": "1859209595", "title": "EarthBound Sound Effects", "file_size": 2044274, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/777356860350637292/741F83A59D16BBC8EBAF2EC61A837E538E8C7F85/", "description": "*A Wild Workshop Item draws near!* Replaces every sound effect (excluding voices and gates (will update once I find sfx for them)) with the appropriate sound taken straight from the hit RPG from 1995!", "time_created": 1568096653, "time_updated": 1568096981, "views": 766, "favorited": 22, "tags": ["audio", "v3.2.3"], "votes": {"up": 16, "down": 2}}, {"id": "1781179233", "title": "Bleh! Vampire Sounds", "file_size": 864564, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/795364376387857206/AF96350FC2E5ECF448B74CE05ED61D02F58B2988/", "description": "I made \"Bleh!\" Vampire sounds, inspired by Bella Legosi and that vampire from the Pink Panther in the \"Pink Plasma\" episode. These were used for a little while during Barony's development instead of the spooky sighing sounds he does in the released version of the Blessed Addition. Vampires should always say Bleh! Note that female Vampires from the Myths & Outcasts DLC will also have this same voice, so they'll sound a little manly.", "time_created": 1561510785, "time_updated": 1561510785, "views": 695, "favorited": 8, "tags": ["audio", "v3.2.3"], "votes": {"up": 11, "down": 0}}, {"id": "2336283891", "title": "Better Bottle Book", "file_size": 5181, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1645468685084912876/10E87A6B3BE3817950A88F95887B8039DAD2686D/", "description": "Makes a \"Bottle Book\" much more useful Attention! This mod dont affect on achievements. So feel free to use Also you can download \"Bottle Book.txt\" file from here: https://drive.google.com/file/d/1sag89XLZGaPXM417vOgPlDHKFn9_Dbs3/view?usp=sharing and drop it into .../Steam/steamapps/common/Barony/books directory", "time_created": 1609015263, "time_updated": 1609016583, "views": 483, "favorited": 11, "tags": ["gameplay", "misc", "v3.3.7"], "votes": {"up": 12, "down": 0}}, {"id": "2613956785", "title": "Translation PT-BR", "file_size": 490327, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1613968461778865581/16E8FC22C96E5A7308B17E6EC5E3A2E84BC720C7/", "description": "link for external download: https://steamworkshopdownloader.io/download/2613956785 a WIP PT-BR Translation", "time_created": 1632861419, "time_updated": 1633085712, "views": 120, "favorited": 2, "tags": ["translations", "v3.3.7"], "votes": {"up": 10, "down": 0}}, {"id": "1688024126", "title": "Sans Baron Herx (SOUND AND MODEL OVERHAUL)", "file_size": 4057647, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/985632674109432611/FC3D180670C279F1FF046B8771D096E8C447DD62/", "description": "You're gonna have a bad time... This mod replaces the boss theme song with Megalovania AND replaces everything that Baron Herx says with sans voice. Every voice file is customly arranged to make it sound different from one another! Credit to Nubbie for providing the song!", "time_created": 1553051513, "time_updated": 1553120140, "views": 1515, "favorited": 16, "tags": ["models  ", "audio", "misc", "gameplay", "textures", "v3.2.3"], "votes": {"up": 10, "down": 0}}, {"id": "1384460488", "title": "DISTORTED SOUND EFFECTS", "file_size": 625539, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/930435128473040852/0E11F896D591357A8210AB36DD9ADE7A54E9A6D1/", "description": "EARRAPE WARNING!! Currently distorted sounds: >Boulder >BoulderCrunch >BoulderThump >Puke >SuccubusDies >ZapBrigade ", "time_created": 1526157487, "time_updated": 1526157487, "views": 1504, "favorited": 11, "tags": ["audio", "v3.1.6"], "votes": {"up": 14, "down": 3}}, {"id": "1685194651", "title": "Weapon edits by erik", "file_size": 31683, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1002520615737682607/0122040BE815B8BD63781EC0E42539C280B1013D/", "description": "Changes some weapon models. i used voxelshop to import and modify various weapons i wanted to change. most changes are minimal and aim towards making weapons look more girthy or deadly, works well with my other mod, damage sound edit, which makes the audio feedback from hitting an enemy sound more beefy, you can get it here https://steamcommunity.com/sharedfiles/filedetails/?id=1685195987 all weapons changed are visible in the screenshots, sorry for the inconsistencies with my snapshots!", "time_created": 1552784643, "time_updated": 1552787483, "views": 1303, "favorited": 13, "tags": ["models  ", "v3.2.3"], "votes": {"up": 9, "down": 0}}, {"id": "1672747678", "title": "Virginia Death Sound", "file_size": 80903, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1007023210967606662/C1FFC8070F3E8496B1CC0D513351F6AA20FE3CE6/", "description": "A true saiyan always sprinkles when he tinkles. (From Dragonzball PeePee by Oney Cartoons) Note: The sound is pretty quiet. Despite my efforts to make the sound louder, the other game sounds drown it out. You'll only hear it properly when there's no other sounds. PS: I am real super sand.", "time_created": 1551663189, "time_updated": 1551664197, "views": 1143, "favorited": 9, "tags": ["audio", "v3.2.3"], "votes": {"up": 9, "down": 0}}, {"id": "2618715815", "title": "Dark Fantasy mod", "file_size": 637655, "preview_url": "", "description": "Armour, weapons, items and furniture replacer. Better than vanilla. Updates every 2 days!", "time_created": 1633293256, "time_updated": 1635239100, "views": 481, "favorited": 9, "tags": ["models  ", "v3.3.7", "textures"], "votes": {"up": 9, "down": 0}}, {"id": "1645759243", "title": "Sad music on Death", "file_size": 1636774, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/947347993680695622/5BD9E2868AD46D8CEA2961B727630E003F74DDE1/", "description": "Replaces death music with Dentist by Little Shop Of Horrors. Replaces just one file: Death.ogg at Barony/sound/ :p ", "time_created": 1549371635, "time_updated": 1549373022, "views": 1150, "favorited": 10, "tags": ["audio", "v3.2.2"], "votes": {"up": 10, "down": 0}}, {"id": "1401882756", "title": "Kabouter Plop", "file_size": 340902, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/921430008397876824/81E5F9748C12D64738101C600E668BB5AFDFFBE7/", "description": "This mod replaces the default gnome model by one that looks like kabouter Plop. Kabouter Plop is the main character in a Belgian TV-show named \"Plop\", created by Studio 100.", "time_created": 1528035427, "time_updated": 1528038082, "views": 741, "favorited": 6, "tags": ["models  ", "v3.1.6"], "votes": {"up": 9, "down": 0}}, {"id": "1619280285", "title": "Diamond Pickaxe", "file_size": 53287, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/951849335339609349/E38710A1F1F5C8FDB8794BE0EDCDC5DBD42FFEB8/", "description": "Diamond Pickaxe, and more soon :-) Changes made: Pickaxe.png, Pickaxe.vox ", "time_created": 1547005143, "time_updated": 1547006055, "views": 1008, "favorited": 5, "tags": ["models  ", "misc", "v3.2.2"], "votes": {"up": 9, "down": 0}}, {"id": "1385710526", "title": "Barony_MLG_Edition", "file_size": 35484, "preview_url": "", "description": "Boulder is OP, deal with it. This mod adds cool MLG sunglasses to the boulder model. It also replaces the regular glasses in the game with some MLG sunglasses. Made in Voxel Shop.", "time_created": 1526278867, "time_updated": 1526278867, "views": 1223, "favorited": 7, "tags": ["models  ", "v3.1.6"], "votes": {"up": 9, "down": 0}}, {"id": "1495404776", "title": "Tales of Hernsfox", "file_size": 730025, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/943955788162385911/D54CB4B935D6C0066DC7567BE7B9B139C04E52B4/", "description": "A set of maps. I'm still working on upgrades, but it is just a bunch of maps which I created. Please, advices, bug reports, improvements, everything is welcome.", "time_created": 1535406955, "time_updated": 1597605139, "views": 1550, "favorited": 14, "tags": ["dungeons", "v3.2.1", "v3.3.6"], "votes": {"up": 10, "down": 1}}, {"id": "2117902771", "title": "\"The Mines\" Tweaks - JSON Mod Example", "file_size": 145543, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1034086476500109377/3E96595A2C761F4E670D58C4DB7C97DD3ED38839/", "description": "Let's spice up The Mines! Example mod of how to use JSON in Barony version V3.3.4+ to add in monster variants for existing monsters, as well as control some map events within the Mines levels. Created to assist with the new JSON modding guide: https://steamcommunity.com/sharedfiles/filedetails/?id=2113716893 Check out the JSON files in the workshop steam installation directory, e.g C:\\Program Files\\Steam\\steamapps\\workshop\\content\\371970\\2117902771 In general, dungeon floor level 1 is pretty tame, while dungeon levels 2/3/4 all escalate with new variations of monsters. Is it balanced? You tell me! Changes: gameplaymodifiers.json: XP range global for multiplayer XP from monsters and gold dropped is 50% normal value Minimap is shared in multiplayer Maximum player speed reduced a bit by around 15% Minimap disabled on floors 2 and 4, as well as Gnomish Mines Minotaur only spawns on floor 4 monstercurve.json: Rat variants - Rats that spawn in 2 or 3s that occasionally speed boost, as well as a rat that explodes into a lot of cheese when killed.Files: rat_pack_2.json, rat_pack_3.json, pack_rat.json. Skeleton variants - Skeletons with basic magicstaffs or ranged weaponry. Files: skeleton_magic.json, skeleton_ranged.json. Spider variants - Spiders that shoot poison or spray web between attacks. Files: spider_web.json, spider_poison.json. Troll variants - What happens if you get screamed at by a troll?Files: troll_fear.json. All the Minetown citizens turned into ghouls! Files: ghoul_shopkeeper_magic.json, ghoul_shopkeeper_food.json, ghoul_shopkeeper_equipment.json ", "time_created": 1591205749, "time_updated": 1591289073, "views": 1238, "favorited": 10, "tags": ["dungeons", "gameplay", "v3.3.4"], "votes": {"up": 8, "down": 0}}, {"id": "2442360959", "title": "33121_DLC3-beta", "file_size": 2986981, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1734423405277509197/501B10ED66DF7DE3B733DC0A9C4C5A7F67A8131A/", "description": "developertestbeta_ // Build Wed Mar 31 21:06:21 CEST 2021 for language \"en\" myHostname = window.location.hostname; var myTLD = \".\" + myHostname.substring(myHostname.indexOf(\"wupload\") + \"wupload.\".length).split(\".\"); function afterLoad() { return } ieFixForFileSelectionOnChangeEventTimer = null; function ieFixForFileSelectionOnChangeEvent(a) { $(\"#siteName\").toggle(); if ($(\"#inputFileSelection\").val() == \"\") { ieFixForFileSelectionOnChangeEventTimer = setTimeout(\"ieFixForFileSelectionOnChangeEvent()\", 200) } else { $(\"body\").focus() } } function urlencode(a) { return escape(a.toString().replace(/%/g, \"%25\").replace(/\\+/g, \"%2B\")).replace(/%25/g, \"%\") }); jQuery.setCookie = function(b, c, a) { var d = new Date(); d.setDate(d.getDate() + a); cookieDomain = \".wupload\" + myTLD; document.cookie = b + \"=\" + escape(c) + ((a == null) ? \"\" : \";expires=\" + d.toUTCString() + \"; path=/;domain=\" + cookieDomain + \";\") }; jQuery.getCookie = function(a) { if (document.cookie.length > 0) { c_start = document.cookie.indexOf(a + \"=\"); if (c_start != -1) { c_start = c_start + a.length + 1; c_end = document.cookie.indexOf(\";\", c_start); if (c_end == -1) { c_end = document.cookie.length } return unescape(document.cookie.substring(c_start, c_end)) } } return \"\" };", "time_created": 1617249473, "time_updated": 1617249473, "views": 583, "favorited": 5, "tags": ["misc", "audio", "models  ", "dungeons", "textures", "gameplay", "translations", "v3.3.7"], "votes": {"up": 8, "down": 0}}, {"id": "1679692900", "title": "Dragon Quest Sounds", "file_size": 33827647, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/990135412901322645/C86C1704AAA5F4F740D8C1A791A3CD56678C2409/", "description": "Sounds and music from the Dragon Quest series! Art: https://www.deviantart.com/hadeki/art/Sleepy-Slime-133916933 ============================================================ citadel00: Battle for the Glory (IV) intermission: Mysterious Shrine (IV) intro01: Overture (XI) labyrinth00: Battle (III) labyrinth01: Pyramid (III) labyrinth02: Cursed Towers (IV) mines00: Battle (I) mines01: Dark Dungeon (I) mines02: Gloomy Cavern (IX) mines03: Dungeon (III) minetown: Peaceful Village (I) shop: Arms Merchant Torneko (IV) swamp00: Deathfight (II) swamp01: Prologue (III) swamp02: Underground (II)", "time_created": 1552265968, "time_updated": 1552346178, "views": 635, "favorited": 17, "tags": ["audio", "translations", "v3.2.3"], "votes": {"up": 8, "down": 0}}, {"id": "2189963274", "title": "Demeine", "file_size": 386484797, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1495711913285040994/2DC83424715973E33FDEC407098F66D2FC0B0D28/", "description": "Play with Classic enabled! Welcome to Demeine, a Barony content modification that replaces all the (original) levels and the entire soundtrack. 1.1 was the bare minimum necessary to get this mod working with the Steam Workshop, therefore there was very little in terms of new content compared to 1.0. My reasoning for uploading this so incredibly late on to the Workshop is the fact that I was originally creating a huge fleshed out update, called \"2.0\", that I had planned to upload instead when it was ready. (Original ModDB page: https://www.moddb.com/mods/demeine ) I lost interest in modding a long time ago but regained it recently, so I decided to finally make the transition with what I had to the steam workshop. With the 1.2 update, I overhauled some levels and polished others to the best of my ability. That being said, I theoretically could have done much more, but I want to save my creative energy for another mod I'm working on. As for Demeine 2.0, I am not sure where to go with it. I have a lot of ideas and work I've put in to it, but I decided recently that I want to do a different type of total conversion. I am reusing some ideas and material from Demeine 2.0 for it, so either 2.0 will basically be absorbed in to this new project, or it will become its own mod in the far future depending on how this new mod turns out, and if I still have enough creative energy by then.", "time_created": 1596794946, "time_updated": 1597495733, "views": 960, "favorited": 10, "tags": ["dungeons", "audio", "textures", "gameplay", "v3.3.6"], "votes": {"up": 7, "down": 0}}, {"id": "1620756320", "title": "You've Been Gnomed (Distorted)", "file_size": 717883, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/951849335347116446/DBE098EC2CA9B9F3FBF277EF3CC198BCAB3BC9F8/", "description": "yOu cAn gEt gNoMeD. iTs tHaT sImPlE :0 Thanks to chazoshtare for the idea Changes made: Language file, Gnome sounds.", "time_created": 1547154381, "time_updated": 1547154381, "views": 1536, "favorited": 14, "tags": ["audio", "misc", "v3.2.2"], "votes": {"up": 12, "down": 4}}, {"id": "1489261328", "title": "L4D tank  - Minotaur soundtrack", "file_size": 5448461, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/968724911470490105/F083A7DD8767B76A955DAD4EB5825A6B2148AE42/", "description": "This will change the music when the Minotaur spawns to the L4D spawning theme :^) The mod will increase the heroi.. uh.. I mean, adrenaline, rush with 20%, or else you will get to unsubscribe for free! Works for multiplayer Changes: * music/minotaur00.ogg * sound/MinotaurAttack.ogg * sound/MinotaurDie.ogg * sound/MinotaurIdle-01.ogg * sound/MinotaurIdle-02.ogg * sound/MinotaurIdle-03.ogg * sound/MinotaurSpot-01.ogg * sound/MinotaurSpot-02.ogg * sound/MinotaurSpot-03.ogg * sound/MinotaurWalk.ogg -DISCLAIMER: I do not own any of the content (music) which is used for entertainment purposes", "time_created": 1534965456, "time_updated": 1534965456, "views": 1092, "favorited": 11, "tags": ["audio", "v3.2.0"], "votes": {"up": 9, "down": 1}}, {"id": "1388270532", "title": "Raid On The Goblin Hideout (BETA)", "file_size": 672867, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/909043577246065056/C7FC7A7E126229BC825118B86360CE9F81B23962/", "description": "A work-in-progress dungeon in which you and a group of friends discover and raid the Goblin Hideout. The cover art is a sketch done by me. Just a placeholder until I can find the time to make a proper piece. Story: King Hodrik (The Goblin King) has been forced into hiding by the human armies who were once split, but joined together to stop the united lands of the Goblins, who frequently pillage human settlements. You are a mercenary hired by a mysterious figure to spill King Hodrik's blood with the intent on bringing peace throughout the lands. Difficulty: Recommended party of 2 minimum, though it is possible to solo. Recommended to play with Minotaur turned off. This mod adds: * 5 hand crafted dungeons. In the future: * I plan on changing sound, and text files so you can uncover the full story yourself. This is just the 'beta', but I've done extensive testing solo and with friends with the intent on making a fun, difficult little adventure. Vanilla Barony is mostly procedurely generated, and random, so to add a bit of variety I went for a hand crafted approach. If you play this, and enjoy it enough, let me know what needs further balancing. If the dungeon is too easy with 4 people, or too difficult solo then I'll look for ways to further balance it for when I eventually finish it.", "time_created": 1526603199, "time_updated": 1526617561, "views": 1499, "favorited": 3, "tags": ["dungeons", "v3.1.6"], "votes": {"up": 7, "down": 0}}, {"id": "2616201690", "title": "繁體中文漢化", "file_size": 11334825, "preview_url": "", "description": "個人翻譯還不太齊全", "time_created": 1633102514, "time_updated": 1633102514, "views": 104, "favorited": 2, "tags": ["translations", "v3.3.7"], "votes": {"up": 6, "down": 0}}, {"id": "2025195984", "title": "Official Script Tutorial Map", "file_size": 175153, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1005932647148004503/5000B38029C60CA544D3C8CD1227A1DB46D84096/", "description": "Walkthrough script examples!", "time_created": 1584445922, "time_updated": 1585325481, "views": 524, "favorited": 5, "tags": ["dungeons", "misc", "gameplay", "v3.3.3"], "votes": {"up": 7, "down": 0}}, {"id": "2538252462", "title": "PVP Fortress Battle [BETA]", "file_size": 1918782, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1708536324577800867/58DEBFAAC9510BD6BA09BEB9C9E4D9658ED93ABB/", "description": "v0.9 This PVP mode is still in the testing phases. Please play with friends and offer feedback! A battle map for 4 Players / Teams (4 players on each team with the experimental 16 player branch). Objective: Prevent anyone else from getting your orb! Collect all four orbs, one from each fortress, and use them to activate the tower at center of the battlefield. Take yours on the run and rely on your strength to protect it, or set up ambushes and traps inside your fortress, daring foes to come to you! The team to activate all four orbs is the winner. A portal opens allowing them to start the battle again. Rules: Friendly Fire needs to be on Inventory needs to drop on death Every player should turn off Player Name Tags Battle Classes: To make more viable PVP strategies, the map requires the player to pick a battle class at the start of each round by entering that class' cell. The player then takes on the role of that class, including new stats, gear and skills. This means that when you pick a class before entering the game, that choice will not matter in the ensuing battle. Only the class you select at the beginning of each round will matter. The four classes are: The Knight Boasting excellent close-range combat gear, the knight is not somebody you want to be caught in a fight with toe-to-toe. However, the knight may have a hard time catching foes who simply take his orb and run! You would be wise not to duel with a knight, and a good knight will force you to have no other option. The Assassin An excellent sharpshooter and trapper, the assassin has speed, stealth and special ammo to take down opponents with precision. They also wield a skeleton key and traps, making the fortresses a place where they can wreak special havoc, slowing, disabling, and slaying intruders and inhabitants alike. However the Assassin has little in the way of defenses, both magical and physical, so striking first is essential to survival. The Magician With a lightning staff and scrolls of recharging, the magician is a deadly weapon of war. With the flutter spell, the magician can traverse pits and water that may slow down others, allowing them to easily solve what might be problems for other classes. While the magician's skills are direct, they are also simple and can be countered. A magician who leaves themselves vulnerable to any other class will not survive long. The Chaplain The chaplain may not seem like much at first. With moderate skill with weapons and magic, and little in the way of offensive ability, chaplains don't have a lot of comparative advantages. However, a careful selection of equipment, spells and potions allow the chaplain to disable, befuddle and evade high-power foes, whether physical or magical. A novice chaplain may die quickly on the battlefield if they attempt to compare apples to apples, but a resourceful one will out-wit and out-maneuver their competition, leaving them feeling like they had no way to fight back. Note: Because your class is cleared at the start of the match, your hotbar will be empty. To make setting up your hotbar quicker, consider using the \"Numpad to Hotbar\" setting in the Misc. settings tab, allowing you to quickly assign items by hovering with your mouse, and pressing the key you want it assigned to. Races DLC races can be used with this game mode, but racial spells will be overridden in favor of distinct battle class abilities. As a result, races will keep behavior such as their reactions to curses and blessings, as well as weapon type, magic and environmental resistances or vulnerabilities. In many cases, Human is the best race to choose for this game mode, but other variation brought by the monster races is welcome and considered a viable part of the game mode, even if they lack their native spells. The Map Fortresses There are four fortresses: The Mines Fortress which holds the Green Orb The Labyrinth Fortress which holds the Red Orb The Ruins Fortress which holds the Blue Orb The Hell Fortress which holds the Purple Orb Each fortress is identical in layout, though mirrored according to the corner of the map they are in. Each fortress also holds a variety of chests. Every player will have 30 seconds to pick their class and prepare for battle before the fortress gates open, letting the team come out, and allowing intruders to come in. As you play, note how you might slow an enemy's advance through your fortress, and require them to take risky paths where you could spring traps upon them. Chests and Random Items There are many chests distributed throughout the map and their exact contents are randomized. However, you will be able to find certain kinds of items within the chests consistently, including potions, hardware, equipment, and magic items. Sometimes these chests will be locked. This is an intended advantage for the assassin class. All classes should also pay close attention to their skills, as chests may contain all kinds of things they can benefit from using their expertise. For example, the Assassin is an exceptional Tinker, and the Chaplain is a great Alchemist. Orb Colors The map has four fortresses, each containing a colorful orb. Between them is an island, where each orb must be placed to finish the match. The correct orb must be placed at each pedestal, pointing to its corresponding fortress. The edge of that fortress' corner has a decorative imitation of the orb embedded into its walls. Use this as an indicator to see both where you will obtain the orbs, and what pedestal the orb should go into when you have obtained it. Note: Whenever a player removes or places an orb, the action is permanent and an announcement is made to every player. Use this information to keep track of how the battle is going. Update v0.9 Attached a poison effect to players whose orb has been removed from their fortress. Added a 10 minute timer which spawns tower guardians to hurry the game toward completion. Added a timer warning in two minute increments leading up to 10 minutes. Added bridges to the central tower island, and enlarged the island slightly. Removed summon scroll and spellbot items from the Magician class. Added Teleport Other and Potions of IceStorm to the Magician class. Increased Magician health to 75 to match the Assassin. Reduced Knight AC by reducing the blessings on their armor. Reduced the Knight's Speed Potion count to 1. Increased the Chaplain's damage by increasing the blessing on their mace.", "time_created": 1625512525, "time_updated": 1627021355, "views": 542, "favorited": 13, "tags": ["dungeons", "gameplay", "misc", "v3.3.7"], "votes": {"up": 6, "down": 0}}, {"id": "2390335304", "title": "Bender the Booze-Fueled Robot", "file_size": 216000, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1771573592459914120/159EE20462EC939FD11AD6F67AF18EE6B6EC6224/", "description": "This mod replaces the Goatman player race with models and sound effects based on Bender Bending Rodriguez from Futurama. Go on a booze-fuelled rampage and kill all humans! *Enemy Goatmen are unaffected visually, but their sounds will be replaced with Bender's lines when using this mod. Funny Bones can bite my shiny metal ass.", "time_created": 1612943450, "time_updated": 1612943518, "views": 428, "favorited": 5, "tags": ["audio", "models  ", "v3.3.7"], "votes": {"up": 6, "down": 0}}, {"id": "2391038883", "title": "Happy Barony Valentine's", "file_size": 609514, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1772699582120639831/5780B39FE5518B942A110B707B62B27AFA686363/", "description": "In the mood for love? Adds Valentine's Day themed models for various objects and creatures. v1.0 Tile set recolor and texture for Mines. v.9 Red dresses for enemy Succubi and seductive suits for enemy Incubi. Cupid replaces Imp. Item replacements for meat, scrolls, arrows, bolts, torches. Chocolate fountain!", "time_created": 1613001231, "time_updated": 1613356960, "views": 602, "favorited": 19, "tags": ["models  ", "textures", "v3.3.7"], "votes": {"up": 6, "down": 0}}, {"id": "1408569584", "title": "Minecraft Puking Noise", "file_size": 20912, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/930437902040532653/FF2287FE76085330AFA355AC46227A11C5652333/", "description": "Simply Epic. Goes well with Roblox death noise. https://steamcommunity.com/sharedfiles/filedetails/?id=1383277228&searchtext=", "time_created": 1528674530, "time_updated": 1528675845, "views": 1582, "favorited": 14, "tags": ["audio", "v3.1.6"], "votes": {"up": 6, "down": 0}}, {"id": "1757122416", "title": "Traduccion español", "file_size": 180836, "preview_url": "", "description": "Añuña", "time_created": 1559326129, "time_updated": 1559326129, "views": 422, "favorited": 4, "tags": ["translations", "v3.2.3"], "votes": {"up": 6, "down": 0}}, {"id": "2194368690", "title": "Barony ESRGAN AI upscaled tiles 512x512", "file_size": 73992508, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1476571241327552974/BC2193713FE62ACBF13503BD505D9B8B6E35E5EE/", "description": "Original(new) game tiles upscaled! Availiable ASIS since I did it upon one of the game upscaling Discord users request because I had the game installed. These are original 32x32 tiles from the game upscaled with the same model twice. I tried to go for 2048x2048 or 1024x1024 tile size but the game crashes if I try to load anything bigger. Also images are optimized using oxipng. Model used: Fatal Pixels: https://upscale.wiki/wiki/Model_Database#Pretrained_models_for_different_scales", "time_created": 1597165259, "time_updated": 1597167076, "views": 603, "favorited": 10, "tags": ["textures", "v3.3.6"], "votes": {"up": 8, "down": 2}}, {"id": "1387016124", "title": "Recipe Books", "file_size": 725068, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/921428476194293960/1990AF6D9F52A1A1C0E380F3883C02A1CE577AF1/", "description": "gotta do the cooking by the book 9 books with 8 full recipes and 1 \"quick eats\" journal A mix of real life recipes, game-related recipes, and exotic recipes. Any recipe that I stol- paraphrased will be credited at the bottom.", "time_created": 1526444286, "time_updated": 1526451901, "views": 925, "favorited": 4, "tags": ["misc", "v3.1.6"], "votes": {"up": 6, "down": 0}}, {"id": "1751251332", "title": "Meme Hell", "file_size": 183735561, "preview_url": "", "description": "That's barony but shitposted", "time_created": 1558787919, "time_updated": 1558787919, "views": 560, "favorited": 6, "tags": ["audio", "misc", "v3.2.3"], "votes": {"up": 11, "down": 5}}, {"id": "2101580795", "title": "Crosshair -> Cursor", "file_size": 1308, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1004811522584627279/A57E586455FBFC713680A7DDD045E6A57AE77B67/", "description": "Changes the normal crosshair to the cursor. This is normally for individuals who have trouble picking up items or interacting with objects in the world such as levers.", "time_created": 1589855772, "time_updated": 1589856649, "views": 487, "favorited": 12, "tags": ["v3.3.3", "misc", "v3.3.4", "gameplay", "v3.3.5"], "votes": {"up": 5, "down": 0}}, {"id": "2547359581", "title": "Mine of Astor", "file_size": 1161861, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1695026443965622103/0A7B651131854B7E33324872766F388DDAB60C8A/", "description": "This is the first dungeon I have created with the Barony Editor. I have added books to add some lore that has nothing to do with the main game. There are 4 areas, a total of 20 Levels (16 generated, 4 \"boss-stages\") and also 8 secret areas (static). I'm not sure about the difficulty but you can tell me if you find it too hard or too easy and feel free to leave your thoughts or bug-reports in the comments. I have not added any textures, models or music. Here is a GameBanana download if you don't own the steam version: https://gamebanana.com/mods/310207", "time_created": 1626310616, "time_updated": 1631914065, "views": 362, "favorited": 6, "tags": ["dungeons", "v3.3.7", "gameplay"], "votes": {"up": 5, "down": 0}}, {"id": "2539351751", "title": "Books translation to PT-BR", "file_size": 374720, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1693899788964631438/ADA26AFF199BFB258899EA18A68D7024B89C3A65/", "description": "All books translated to Brazilian Portuguese, the text was translated and proofread by me and my friend aarn, obviously there must be some errors, feel free to post them here I will be happy to update mod!", "time_created": 1625605076, "time_updated": 1625612733, "views": 149, "favorited": 4, "tags": ["translations", "v3.3.7"], "votes": {"up": 5, "down": 0}}, {"id": "2146015753", "title": "8 Bit - Destroyer of the Universe song for Herx Boss Battle", "file_size": 2651109, "preview_url": "", "description": "Enjoy!!! Disclaimer: I do not own any rights regarding Amon Amarth.", "time_created": 1593370465, "time_updated": 1593370465, "views": 124, "favorited": 3, "tags": ["audio", "v3.3.4"], "votes": {"up": 6, "down": 1}}, {"id": "1619965175", "title": "Bruh Death Effect #2", "file_size": 814012, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/951849335342992981/CEE2B1716120C8D3AB52EB4686CDE762474BD167/", "description": "Replaces ALL death sound effects with the Bruh Sound Effect #2 Changes Made: RatDie.ogg GoblinDie-01.ogg GoblinDie-02.ogg GoblinDie-03.ogg SuccubusDies.ogg TrollDie.ogg SkeletonDie.ogg ScorpionDie-01.ogg ScorpionDie-02.ogg ScorpionDie-03.ogg MinotaurDie.ogg GhoulDie-01.ogg AutomatonDie1V1.ogg AutomatonDie2V1.ogg CrystalGolemDie1V1.ogg CrystalGolemDie2V1.ogg CrystalGolemDie3V1.ogg CrystalGolemDie4V1.ogg IncubusDie1V2.ogg IncubusDie2V2.ogg IncubusDie3V2.ogg InsectoidDie1V1.ogg InsectoidDie2V1.ogg InsectoidDie3V1.ogg InsectoidDie4V1.ogg KoboldDie1V1.ogg KoboldDie2V1.ogg KoboldDie3V1.ogg KoboldDie4V1.ogg ScarabDie1V2.ogg ScarabDie2V2.ogg ShadowDie1V1.ogg ShadowDie2V1.ogg VampireDie1V1.ogg VampireDie2V1.ogg VampireDie3V1.ogg VampireDie4V1.ogg GoatmanDie1V1.ogg GoatmanDie2V1.ogg SlimeDeath.ogg Death.ogg orpheus_deathV1.ogg erudyce_deathV1.ogg CockatriceDeath1V2.ogg CockatriceDeath2V2.ogg", "time_created": 1547072216, "time_updated": 1547073740, "views": 753, "favorited": 12, "tags": ["audio", "v3.2.2"], "votes": {"up": 5, "down": 0}}, {"id": "2189931186", "title": "Improved Wall-clang Animation", "file_size": 295114, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1461934085963467422/AB9F33BADE58D388A40B733F04686166BA04CD35/", "description": "This mod changes the Wall-clang animation to look smoother.", "time_created": 1596791694, "time_updated": 1596792557, "views": 377, "favorited": 3, "tags": ["textures", "misc", "v3.3.6"], "votes": {"up": 4, "down": 0}}, {"id": "2522791364", "title": "Loser's Music", "file_size": 149779117, "preview_url": "", "description": "For when you die in the mines, alone and scared, you can listen to this.", "time_created": 1624241822, "time_updated": 1624241822, "views": 153, "favorited": 0, "tags": ["v3.3.7"], "votes": {"up": 3, "down": 0}}, {"id": "2427873812", "title": "Persona Music Mod", "file_size": 134042751, "preview_url": "", "description": "Persona music for Barony! Tracks from Persona 3,4, and 5.", "time_created": 1616024059, "time_updated": 1616024059, "views": 147, "favorited": 5, "tags": ["audio", "v3.3.7"], "votes": {"up": 3, "down": 0}}, {"id": "2148826582", "title": "Armory", "file_size": 422912, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1289668118326447842/055A8478E541E19133C2927103522F5A0EF546AC/", "description": "A collection of random models for general use. No ideas or global projects are planned. Mod is created solely because of a creative impulse. Originally mod does not replace any models! It is used as a storage for models. Unfortunately, I can't add this to the game because I don't have the visual studio tool available. Each model has a default name so that you can understand which model to replace. Use this work as you wish.I will complement it when I am again in the power of inspiration.", "time_created": 1593554363, "time_updated": 1593708397, "views": 1056, "favorited": 8, "tags": ["models  ", "v3.3.4"], "votes": {"up": 4, "down": 0}}, {"id": "1850277861", "title": "Croc: Legend of the Gobbos - Music Pack", "file_size": 104548654, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/784111175459358629/ACB905234D6B6937DC5AB1FA92129EBDE28660B1/", "description": "\"Ker-splat!\" - Croc A semi-obscure gem from the PSX era, Croc: Legend of the Gobbos is bringing it back with this music mod pack for Barony! With a slew of song choices that covers every single track in the game, play through with a very off-the-wall whimsical tone that strangely fits each of the numerous dungeon layers. Disclaimer for the creator who made the original songs and publishing stuff:Croc: Legend of the Gobbos, was developed by Argonaut Software, published by Fox Interactive.Music composed by Justin Scharvona.", "time_created": 1567258502, "time_updated": 1567343724, "views": 495, "favorited": 4, "tags": ["audio", "v3.2.3"], "votes": {"up": 5, "down": 0}}, {"id": "1645873754", "title": "Tim Allen Voiceover", "file_size": 6082094, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/947348594928933984/A9D44DE90E61C0732C6490CEBFF890CB66670734/", "description": "Mod replaces all sounds from Barony/sound folder to Tim Allen's grunt that's it :p", "time_created": 1549380669, "time_updated": 1549894424, "views": 858, "favorited": 5, "tags": ["audio", "v3.2.2"], "votes": {"up": 9, "down": 4}}, {"id": "2146355398", "title": "New Female Goblin Hair", "file_size": 19973, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1288542049588477449/7B62BCB6B3D4CD885B630C058513F6E3AEC20B11/", "description": "I wasn't entirely fond of the hair for the female goblin model so I changed it up a bit. because goblins are known for their full, luscious and kempt hair ", "time_created": 1593387614, "time_updated": 1593395530, "views": 278, "favorited": 2, "tags": ["models  ", "misc", "v3.3.4"], "votes": {"up": 3, "down": 0}}, {"id": "1590750251", "title": "(WIP) Traduction Française / French Translation", "file_size": 300051, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1760320624398199656/793C4E3CF62C9DB56369249A2FEFAAF380EDB7DC/", "description": "Attention ! La traduction n'est pas terminée (le plus gros est fait cependant) Un mod permettant d'afficher son jeu en Français. Pour ce faire, deux façons : Abonnez vous à ce mod puis dans le menu principal du jeu, cliquez sur \"Workshop\", puis \"get subscribed item list\" pour afficher les mods dont vous êtes abonné et enfin cliquez sur \"Load item\" et \"start modded game\". Votre jeu est maintenant en Français. Fonctionne également en multijoueur (les autres membres doivent réaliser les mêmes étapes de leur côté). OU Abonnez vous à ce mod et rendez vous dans le dossier du mod une fois téléchargé (il se trouve dans steamapps\\workshop\\content\\371970\\1590750251) copiez le fichier EN.txt qui se trouve dans le dossier lang et remplacez celui du jeu (steamapps\\common\\Barony\\lang). Je recommande cette méthode.", "time_created": 1544811366, "time_updated": 1618742186, "views": 71, "favorited": 1, "tags": ["translations", "v3.2.2", "v3.3.3", "v3.3.7"], "votes": {"up": 3, "down": 0}}, {"id": "2485089913", "title": "Shrek's voice for trolls", "file_size": 159332, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1771581837460939528/F3864882B99F7748146B6924B0E4B090C140E61A/", "description": "Replaces the troll's spot and death sounds with Shrek's voice. I made this to use it together with the Shrek model you can find in the required items (though it's not really required but just recommended).", "time_created": 1620838235, "time_updated": 1620839458, "views": 292, "favorited": 5, "tags": ["audio", "v3.3.7"], "votes": {"up": 4, "down": 0}}, {"id": "2336816529", "title": "Pwn25's Holiday Weapons Texture Pack", "file_size": 606756, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1649972270309687354/1A6A69CCB3B6EDFEE1949CA5A2684A735347CA14/", "description": "Have you ever wanted just a little more of that holiday spirit to spice up your dungeon crawling? Well then this is the perfect mod for you. This pack of 32 differently customized weapons will surely blow your stockings away with how much festive spirit that is practically bursting out from all of them. The mod changes the appearance the following weapons- Bronze Sword, Iron Sword, Steel Sword, Crystal Sword, Dyrnwyn Bronze Axe, Iron Axe, Steel Axe, Crystal Axe, Parashu Bronze Mace, Iron Mace, Steel Mace, Crystal Mace, Sharur QuarterStaff, Iron Spear, Steel Halberd, Crystal Spear, Gungnir Shortbow, Longbow, Compound Bow, Khryselakatos Sling, Crossbow, Heavy Crossbow, Whip Bronze Tomahawk, Iron Dagger, Steel Chakram, Crystal Shuriken Since this mod only changes the physical appearance the the weapons, this mod is both mutliplayer and achievement friendly. Have fun and happy holidays!", "time_created": 1609040957, "time_updated": 1609042402, "views": 221, "favorited": 6, "tags": ["textures", "models  ", "v3.3.7"], "votes": {"up": 4, "down": 1}}, {"id": "2183961321", "title": "Multiplayer Tweeks", "file_size": 813012, "preview_url": "", "description": "A mod that makes xp global and shares mini-map progress across all players", "time_created": 1596260243, "time_updated": 1596260243, "views": 1071, "favorited": 32, "tags": ["gameplay", "v3.3.5"], "votes": {"up": 6, "down": 3}}, {"id": "2649864280", "title": "Neco Arc over gnomes", "file_size": 567135, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1831270838185329498/B5DB52F793F666E58CE177924C32A845DD80ECA7/", "description": "This mod changes the gnome's model to be that of Neco Arc, the cat-like parody of Arcueid Brunestud. Not only does this alter the entire model, but it also comes with its own sound effects, all corresponding to ambient, player detection and death. Destroy, recruit, or observe these cats as they wander around the world, armed with deadly staves and pickaxes, as they plot to take over humanity as their cat-food producing slaves. -------------- Model created by me. Sound effects ripped from Melty Blood: Actress Again Current Code.", "time_created": 1636434115, "time_updated": 1636434115, "views": 97, "favorited": 6, "tags": ["models  ", "audio", "v3.3.7"], "votes": {"up": 2, "down": 0}}, {"id": "1463102051", "title": "Dunce Hat!", "file_size": 463001, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/974352746860687896/0AE32744D5163F2343460A5260F86E883124CC4C/", "description": "After a long unhealthy discussion on Discord; the terms of a hat missing in Barony was concluded. The Dunce Hat. To all players who wants to show of their skills, as it's the Joker who wears it. Replaces the Jester hat for the Joker, and also his name to Dunce Changes: * items/images/HatJester.png * lang/en.txt (version 3.4.4) * models/items/HatJester.vox Note: The hat covering the eyes wont make you blind - was a bug.. which is now a feature! ", "time_created": 1533247696, "time_updated": 1595785346, "views": 532, "favorited": 3, "tags": ["models  ", "misc", "v3.1.7", "v3.2.1", "v3.2.2", "v3.3.4"], "votes": {"up": 3, "down": 0}}, {"id": "2457579236", "title": "Goatmen Tweak", "file_size": 120397, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1749061393352673504/B9E8E5EEA28C0DBC7816E4356262C396E62E543A/", "description": "A slight Aesthetic tweak for the goatmen. It really only changes the faces, so there isn't really much use for this mod unless you don't like how vanilla goatmen look, which is really just up to personal preference. Also, you do need the myths and outcasts DLC for this to work... Feedback is always appreciated and if the mod isn't working for you for whatever reason, please let me know.", "time_created": 1618465317, "time_updated": 1618465317, "views": 360, "favorited": 6, "tags": ["models  ", "v3.3.7"], "votes": {"up": 2, "down": 0}}, {"id": "2139029289", "title": "Pokemon Overhaul (WIP)", "file_size": 99428, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1253638567068298107/2490D28CF2E01A7E43464EC9A3B1292F537F631B/", "description": "WIP Overhaul of Barony to add a Pokemon feel to the game! Current Features: -Voltorbs instead of Boulders -Voltorb Chunks instead of Rocks -Honedge instead of Dyrnwyn -Nosepass instead of Gnome -Quagsire instead of Troll", "time_created": 1592883495, "time_updated": 1592888407, "views": 863, "favorited": 11, "tags": ["models  ", "v3.3.4"], "votes": {"up": 2, "down": 0}}, {"id": "2135384006", "title": "Undertale Music Replacement Pack", "file_size": 52737914, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1250260617974501578/F8EE935F660943F21A120F61B2DC6D5929809F9F/", "description": "undertale x barony crossover i'm sorry, this was inevitable This mod replaces most of the Barony's classic levels with tracks from Undertale. You know, that critically acclaimed single-player role-playing indie video game by Toby \"Radiation\" Fox which was developed in GameMaker Studio and first released on September 15, 2015 and is currently available on a variety of platforms such as Microsoft Windows, macOS, PlayStation 4, PlayStation Vita, and Nintendo Switch and has sold over one million copies to date. anyway below is the list of track replacements Menu Themes: Don't Give Up, Premonition, Undertale (Unused Version) Intermission Levels: Mysterious Place Mine Levels: Heartache (battle music) An Ending, Respite, Ruins, Ruins (Unused Version) Minetown: Snowdin Town Swamp Levels: Spear of Justice (battle music) Chill, Quiet Water*, Waterfall (*Not the original, a \"remixed\" version by SugarJackson: https://www.youtube.com/watch?v=me2mSYTRh2k) Sand Labyrinth Levels: Stronger Monsters (battle music) Another Medium, CORE Ruin Levels: Power of -NEO- (battle music) Amalgam, Here We Are VS. Baron Herx: Bergentrückung + ASGORE *NEW* VS. Baphomet Battle Against a True Hero Ending Credits: Reunited Minotaur Chase: Run! Death: Determination Some things to note: • Tracks may be subject to change. • This mod really is a bit of an experiment; I think it works well for the most part but there might be some minor issues. • Again, this only replaces most of the classic levels. The Crystal Caverns and Citadel levels have not been changed, neither have the Minotaur themes. • \"Premonition\" seems to be the only menu track that plays upon loading the mod. Nevermind, \"Don't Give Up\" seems to sometimes play, too. • I tried to stick with songs from the original soundtrack (or at least songs composed by Toby Fox himself: see here ); currently, there is only one exception. I'll probably have to dip into remixes for future levels beyond the classic ones. • Megalovania is not a track that's used. Not yet, at least. You know damn well why. • I'm fully aware that name-wise, it would have made more sense to switch the tracks used in the first levels (Mines) with the last levels (Ruins), but eh. I think that's about it. something something you're filled with determination blah blah blah ", "time_created": 1592597975, "time_updated": 1599169329, "views": 379, "favorited": 15, "tags": ["audio", "v3.3.4", "v3.3.7"], "votes": {"up": 2, "down": 0}}, {"id": "2264006761", "title": "Lyiusa's Revamped Artifacts", "file_size": 133059, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1690498704088141559/11C2B71B937A0BACB9126F4F4EA2565AE068B7F3/", "description": "Includes Inventory Images. This mod includes as of Version 1.0 Artifact Helm Remodel + Resprite-- Wizard hat w/ Horn. Artifact Cloak Remodel + Resprite -- Black Instead of White. This mod will not be compatible with mods that change these items appearance.", "time_created": 1603300798, "time_updated": 1603300798, "views": 242, "favorited": 2, "tags": ["models  ", "textures", "v3.3.7"], "votes": {"up": 2, "down": 0}}, {"id": "2322380068", "title": "Ulg's Blessed Hair Gel: Groomed Gentlegoblin (Male)", "file_size": 16086, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1655600828599864568/AB66581234A80291C526F1E8AEAF67369AC525F6/", "description": "You ever feel like your Goblin could use a new 'do? With the power of Ulg's Blessed Hair Gel you can grow hair in an instant and style it any way you like using one of his various packages. Ulg's Groomed Gentlegoblin package will make you sprout a fine waxed mustache! More hair packages can be found below! The \"Punk\" Package", "time_created": 1608083838, "time_updated": 1608083838, "views": 75, "favorited": 0, "tags": ["models  ", "v3.3.7"], "votes": {"up": 2, "down": 0}}, {"id": "1752737545", "title": "From Herx to Hell", "file_size": 1008359, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/804368568030237100/01F03176E0FDEBE0757A917F89B563D8BC1C5CD3/", "description": "Very simple mod, Adds a portal in the Baron's lair, so you can go from the Ruins, to Hell, and then back to Hamlet all in the same run. ________________", "time_created": 1558895279, "time_updated": 1577657870, "views": 688, "favorited": 9, "tags": ["dungeons", "gameplay", "v3.2.3", "v3.2.4", "v3.3.0"], "votes": {"up": 2, "down": 0}}, {"id": "1753104823", "title": "M&B Warband Quest Succeeded", "file_size": 320301, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/794235468870465749/24FB1F3FCBA9608174DCA0EE6F402BFFA2FEF988/", "description": "Changes the LevelUp Sound to the Quest Succeeded Sound from Mount & Blade: Warband.", "time_created": 1558925854, "time_updated": 1558932046, "views": 279, "favorited": 5, "tags": ["audio", "v3.2.3"], "votes": {"up": 2, "down": 0}}, {"id": "1436341553", "title": "Edgy Gnomes", "file_size": 457070, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/958587853814587886/36EAE2AE83672BCF58F068B9171DE791FF328932/", "description": "Gives the gnomes a bit more emotion. Fear and threatening ensues. Courteousy to M&B:Warband for the soundfiles.", "time_created": 1531148924, "time_updated": 1531148924, "views": 1088, "favorited": 5, "tags": ["audio", "v3.1.7"], "votes": {"up": 2, "down": 0}}, {"id": "1602491784", "title": "DBZ Instant Transmission", "file_size": 18923, "preview_url": "", "description": "Changes the teleport sound into the DBZ Instant Transmission sound.", "time_created": 1545791508, "time_updated": 1545791508, "views": 232, "favorited": 4, "tags": ["audio", "v3.2.2"], "votes": {"up": 3, "down": 1}}, {"id": "1531753213", "title": "Jims Test of Fate 5", "file_size": 90055, "preview_url": "", "description": "he needs help", "time_created": 1538825578, "time_updated": 1538825578, "views": 207, "favorited": 1, "tags": ["dungeons", "v3.2.2"], "votes": {"up": 3, "down": 1}}, {"id": "2078441937", "title": "Croc 2 - Music Pack", "file_size": 121347969, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1013816953984070614/A54471A3FE608F2D4A63DE62CB1035F365FB12CB/", "description": "\"Ka-boof!\" - Croc The sequel to the PSX hidden gem, Croc 2 has a more grounded soundtrack than the first, perfect for the tone of Barony while spicing things up with a fair amount of whimsy. Though not as many tracks as the first, each still provides a lot of charisma to any modded playthrough. Disclaimer for the creator who made the original songs and publishing stuff: Croc 2, was developed by Argonaut Software, published by Fox Interactive. Music composed by Karin Griffin, with additional music by Justin Scharvona.", "time_created": 1588186665, "time_updated": 1588186665, "views": 222, "favorited": 2, "tags": ["audio", "v3.3.3"], "votes": {"up": 3, "down": 1}}, {"id": "2322359946", "title": "Ulg's Blessed Hair Gel: Punk (Male)", "file_size": 13065, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1655600828599814585/442B9E582638CEFF1E9AFC4F329FD6DAD196D48F/", "description": "You ever feel like your Goblin could use a new 'do? With the power of Ulg's Blessed Hair Gel you can grow hair in an instant and style it any way you like using one of his various packages. Ulg's Punk package will give you a mohawk and a gold earring! (Don't ask how we managed to get the gold.) More hair packages can be found below! The \"Groomed Gentlegoblin\" Package", "time_created": 1608082179, "time_updated": 1608083027, "views": 33, "favorited": 0, "tags": ["models  ", "v3.3.7"], "votes": {"up": 1, "down": 0}}, {"id": "2241732426", "title": "Barony: Hellraiser Edition - 512 Vanilla A.I. Enhanced Tiles", "file_size": 119186376, "preview_url": "", "description": "I used Esrgan to upscale the Tiles for Barony. I saw that some users posted either an HD pack or Esrgan pack already but I did not like them that much. Too much inconsistencies. So here we are my very first Barony Mod. Hope yall enjoy, spent a lot of time on this experimenting with different results. I will be releasing at least 4 more versions. Possibly 10 if I release them all. Cheers! Mod for Barony is now on my google drive for non steam users https://drive.google.com/drive/folders/1u8p5tvhtvwzTbLKi67pDQFs-gkDLO1b-?usp=sharing Uploaded to Google Drive until I can release on Nexus. Will be on Nexus Site soon so you can manually download and inject into game to keep forever without having to load the mod. ", "time_created": 1601264104, "time_updated": 1601264104, "views": 294, "favorited": 1, "tags": ["v3.3.7", "textures"], "votes": {"up": 1, "down": 0}}, {"id": "1685195987", "title": "Damage Sound edit", "file_size": 27035, "preview_url": "", "description": "changes the damage audio to something a bit more beefy.", "time_created": 1552784755, "time_updated": 1552787465, "views": 245, "favorited": 2, "tags": ["audio", "v3.2.3"], "votes": {"up": 1, "down": 0}}, {"id": "2457596064", "title": "Barony 20XX Player Races", "file_size": 100027, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1749061393352800625/BD89F404D6F170DFFCADB9F801E616791379658D/", "description": "Just thought it would be nice to be able to play as the races shown in the 20XX overhaul since nobody else has done it yet. Just ported the models from the mod itself into the player race directories and here they are. Might possibly do something for the other races to make them fit in better with the rest of all this but I also might not... We'll just have to see, I guess... Feedback is always appreciated and let me know if this isn't working for you for whatever reason.", "time_created": 1618467759, "time_updated": 1618467759, "views": 663, "favorited": 6, "tags": ["v3.3.7"], "votes": {"up": 2, "down": 1}}, {"id": "1648391563", "title": "F**KING GNOMES", "file_size": 163430, "preview_url": "", "description": "just changes some text", "time_created": 1549600672, "time_updated": 1549600672, "views": 324, "favorited": 2, "tags": ["misc", "v3.2.2"], "votes": {"up": 1, "down": 0}}, {"id": "1750728253", "title": "Argonian Heads", "file_size": 11205, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/793109568953581983/20C1CE4114C76322A27D72E14D1BAD86F8DA578A/", "description": "Replaces male and female snakestone heads with argonians from the Elder Scrolls franchise.", "time_created": 1558738354, "time_updated": 1558739910, "views": 416, "favorited": 1, "tags": ["models  ", "v3.2.3"], "votes": {"up": 2, "down": 1}}, {"id": "2390187421", "title": "Vampires are Elves now!", "file_size": 39042, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1771573592459063700/314785E2A22C29E997E4F8D0FE04667A2475321A/", "description": "Ever wish you could suck blood and look fantastic doing it? Well look no further because this mod changes those dreary old player vampire models into beautiful, golden haired Fabio look-alikes. Be the cannibal fairy creature you always dreamed you could be! Alternatively, play with aesthetic skin only to live out your Legolas fantasy in Barony. Enemy vampires are not affected by this mod. (Models made with VoxelShop/MagicVoxel software)", "time_created": 1612925926, "time_updated": 1612927239, "views": 77, "favorited": 2, "tags": ["v3.3.7", "models  "], "votes": {"up": 1, "down": 1}}, {"id": "2223808292", "title": "Level_up", "file_size": 9659, "preview_url": "", "description": "A nice level up chime from the good ol' days. This mod is not being used for commercial use, is not part of the base game (and therefore not promised by it's purchase), and may be taken down without notice.", "time_created": 1599625140, "time_updated": 1599625140, "views": 141, "favorited": 1, "tags": ["audio", "v3.3.7"], "votes": {"up": 1, "down": 1}}, {"id": "2199103948", "title": "ReplayBarony", "file_size": 184241, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1493460101230488401/E3525F67E49BB1AB1C1E213A4618223C6A77093A/", "description": "You can replay levels without restart! -add new exits that able to go back to previous level on every 5th floor, boss rooms and hamlet. *this mod is not required overwrite. ", "time_created": 1597564745, "time_updated": 1597564745, "views": 333, "favorited": 4, "tags": ["dungeons", "gameplay", "v3.3.6"], "votes": {"up": 1, "down": 1}}, {"id": "2365651171", "title": "Randy The Startzone Shopkeep", "file_size": 30718, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1637611797108544726/CB7D27D72D678CB553EA7D729287013245A42E0A/", "description": "Randy Darendrake is in town.", "time_created": 1610933447, "time_updated": 1632382879, "views": 107, "favorited": 1, "tags": ["dungeons", "misc", "v3.3.7"], "votes": {"up": 1, "down": 1}}, {"id": "2193679098", "title": "Furry Human Overhaul [WIP]", "file_size": 34160, "preview_url": "", "description": "Replaces the first 6 male human races with Grey Wolf models. #please note that this effectively visually disables headware on human raced characters, and breaks model compliling for women, and every other male race option i havent overwritten yet thanks to the bone offset i had to put in to include a tail. Because of the way that the customized characters are compiled, i have to use the same torso and arm models for 6 appearance selections at a time. So i can only create 3 races atm. First one is Wolf, second one is going to be Felines, and the third is most likely going to be kobolds or argonians or some such. I was honestly just extremely bored and whipped this up in an afternoon. I say wip, but who knows if ill ever actually keep my head down and finish it. Either way, here you go. ", "time_created": 1597098210, "time_updated": 1597099196, "views": 500, "favorited": 5, "tags": ["models  ", "textures", "v3.3.6"], "votes": {"up": 5, "down": 5}}, {"id": "1872716682", "title": "Plants vs. Zombies 2 - Music Pack", "file_size": 59163895, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/777358314189208857/6B9F47303C2BCB087FA1A01FDC137142E85EED67/", "description": "\"Aha! Project Paradox begins...NOW!\" - Dr. Zomboss Take a blast to the past (and other places in time) with the great soundtrack of Plants vs. Zombies 2 to compliment your vanquishing in the dungeons of Barony! With a world theme for each layer, there is a large variety to he seen and heard throughout! I do not claim any of the music used in this modification nor the likeness of the Plants vs. Zombies franchise and its spinoff title, yadda yadda yadda, enjoy!", "time_created": 1569452758, "time_updated": 1569454448, "views": 180, "favorited": 3, "tags": ["audio", "v3.2.3"], "votes": {"up": 1, "down": 1}}, {"id": "1823055483", "title": "Maze of Destruction v1.0", "file_size": 66594, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/795368055537258904/9C971502E7DA7C74F5BFF058DEEFC59F1032A184/", "description": "Dont go the wrong way (: For full experience choose Merchant class or any class with improved vision. EASY MODE: Wizard with light spell. I WILL BE UPDATING THIS MAP WITH MONSTERS, MESSAGES, AND MORE TRAPS!!! IM ALSO WORKING ON A SYSTEM THAT CHANGES THE MAP AS YOU DO IT!! Special thanks to: Ye Ole Greg for testing.", "time_created": 1564772865, "time_updated": 1564940911, "views": 314, "favorited": 4, "tags": ["dungeons", "v3.2.3"], "votes": {"up": 1, "down": 1}}, {"id": "1753153875", "title": "Warband Gnomes", "file_size": 17933216, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/794235468870460357/24FB1F3FCBA9608174DCA0EE6F402BFFA2FEF988/", "description": "Changes the gnome sounds to warband voicelines.", "time_created": 1558931932, "time_updated": 1558931932, "views": 553, "favorited": 3, "tags": ["audio", "v3.2.3"], "votes": {"up": 1, "down": 1}}, {"id": "1701901391", "title": "Final Fantasy Tactics Music", "file_size": 97467733, "preview_url": "", "description": "FFT Now In Barony!", "time_created": 1554266813, "time_updated": 1554302681, "views": 156, "favorited": 4, "tags": ["audio", "v3.2.3"], "votes": {"up": 1, "down": 1}}, {"id": "1532511191", "title": "Bombo Test 1.0", "file_size": 150999, "preview_url": "", "description": "Description", "time_created": 1538875353, "time_updated": 1538875353, "views": 131, "favorited": 0, "tags": ["misc", "v3.2.2"], "votes": {"up": 1, "down": 1}}, {"id": "1531776018", "title": "Jimmyfucking Run 5.0", "file_size": 63255, "preview_url": "", "description": "Speed of minotaur is randomized Use Jester Class, Drop items to lose weight (Dont use ring) Expect to restart", "time_created": 1538827307, "time_updated": 1538827307, "views": 405, "favorited": 3, "tags": ["dungeons", "translations", "gameplay", "v3.2.2"], "votes": {"up": 3, "down": 3}}, {"id": "2139119086", "title": "Game Tweaks", "file_size": 2097, "preview_url": "", "description": "small tweaks for QoL, increased global exp to 200% (affects players and monsters), exp gain is the entire dungeon (dont need to stay near other players)", "time_created": 1592894572, "time_updated": 1592894572, "views": 449, "favorited": 7, "tags": ["gameplay", "v3.3.4"], "votes": {"up": 1, "down": 2}}, {"id": "2474294699", "title": "The Gnecromancer's Lair", "file_size": 1169724, "preview_url": "", "description": "Enter the lair of the Gnecromancer! dm me if you have feedback credit for image: Mortainius88 - Deviantart ", "time_created": 1619943451, "time_updated": 1619943451, "views": 36, "favorited": 0, "tags": ["dungeons", "v3.3.7"], "votes": {"up": 0, "down": 1}}, {"id": "1532510144", "title": "Welcome to Cheese Town", "file_size": 69902, "preview_url": "", "description": "basically ur on a hunt to kill greg the zomblies family and its in cheese town i think", "time_created": 1538875248, "time_updated": 1538875248, "views": 467, "favorited": 1, "tags": ["dungeons", "gameplay", "v3.2.2"], "votes": {"up": 2, "down": 3}}, {"id": "2474454286", "title": "Eternity Fountain (Beta)", "file_size": 566497, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1777210408083113361/FB13B8B169F34E7DD942B09415DB3D5283A341FF/", "description": "-------------------------------------------------------------------------------------------------- Disclaimer: This map is finished and playable, but it's likely to need serious balancing changes as well as a polishing pass-through. Any feedback is appreciated. -------------------------------------------------------------------------------------------------- -------------------------------------------------------------------------------------------------- What this map is intended for -------------------------------------------------------------------------------------------------- A new secret level/adventure intended for characters who leave the mines feeling pretty powerful, I.E. having hit both the Gnomish Mines/Minetown or just having gotten a few lucky items. Expect tough traps, stronger enemies, and a boss I'm not even entirely sure is regularly feasible. Alchemists and mages will find it especially useful for a quick boost in their class progression in terms of raw material. Everyone else will appreciate the large rewards associated with toughing it out, if you don't die to the mandatory boss. ------------------------------------------------------------------------------------------------- How to Access the Fountain ------------------------------------------------------------------------------------------------- The portal is located in the Mines to Swamp transition. Simply break the back wall on the Mines side treasure room. ------------------------------------------------------------------------------------------------ Known Quirks ------------------------------------------------------------------------------------------------ - The entrance/exit portals/rooms are a little rushed, simply thrown together to facilitate an entrance and ending/exit to the map. I may move the entrance to mines level 4, in order to not block access to the underworld. - It's possible the rewards are either too little or too much. I tried to incentivize repeat visits to the stage on runs rather than just using it as a one time experience. - The boss may be too hard, and some of the encounters may not quite be right. - I forgot to unpin the stats menu before taking screenshots. Whoops! Now it really looks like a beta. - Incubi spawn from the fountains as a result of placement in the level list. They're a bit too much for a character to handle after Mines no matter how strong. ------------------------------------------------------------------------------------------------ Lore that borders on an excuse plot: ------------------------------------------------------------------------------------------------ Long before the Baron was sealed, a fountain full of an \"eternal\" amount of elixirs was found. In short order, it was quickly brought under the control of one opportunist named Krontag and lost to the world, until now.", "time_created": 1619955524, "time_updated": 1619955524, "views": 65, "favorited": 0, "tags": ["v3.3.7"], "votes": {"up": 0, "down": 1}}, {"id": "2266920678", "title": "Lyiu's Misc Models", "file_size": 103145, "preview_url": "", "description": "A bunch of various models. Currently this mod contains Raichu Replacement for the Shaman Rat Form (The viewmodel/head movement issues cannot be fixed -- Sorry!) Rabbit-Like Replacement for Human_Light, as requested by Exerlin on the Barony Discord.", "time_created": 1603573601, "time_updated": 1603573601, "views": 91, "favorited": 0, "tags": ["models  ", "misc", "textures", "v3.3.7"], "votes": {"up": 0, "down": 1}}, {"id": "2413516246", "title": "traduccion en español", "file_size": 217473, "preview_url": "", "description": "Se traduce el juego en españo", "time_created": 1614778519, "time_updated": 1614778519, "views": 166, "favorited": 1, "tags": ["translations", "v3.3.7"], "votes": {"up": 0, "down": 1}}, {"id": "2263979242", "title": "StephansTollesAdventure", "file_size": 785010, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1692750503809435905/74EAD9BA3B57425F23A3647D4DED8252D41F0B2B/", "description": "Es ist mehr oder weniger toll.", "time_created": 1603298721, "time_updated": 1603298721, "views": 50, "favorited": 0, "tags": ["dungeons", "v3.3.7"], "votes": {"up": 0, "down": 1}}, {"id": "2258718554", "title": "'il mare eterno nella mia anima' on Death", "file_size": 2196740, "preview_url": "", "description": "Replaces the death song with \"il mare eterno nella mia anima\" from jojo's bizarre adventure.", "time_created": 1602803000, "time_updated": 1602803000, "views": 29, "favorited": 0, "tags": ["audio", "v3.3.7"], "votes": {"up": 0, "down": 1}}, {"id": "2216577866", "title": "New Entry Area", "file_size": 20052, "preview_url": "", "description": "Just a more lush entry area.", "time_created": 1598981726, "time_updated": 1598981726, "views": 68, "favorited": 0, "tags": ["dungeons", "v3.3.7"], "votes": {"up": 0, "down": 1}}, {"id": "1433393632", "title": "WoW! a Horrible Mod!", "file_size": 336485, "preview_url": "", "description": "Bad", "time_created": 1530899308, "time_updated": 1530920523, "views": 791, "favorited": 0, "tags": ["models  ", "misc", "textures", "v3.1.7"], "votes": {"up": 0, "down": 1}}, {"id": "2225223310", "title": "sad man", "file_size": 224164, "preview_url": "", "description": "Changes the skeleton die sound", "time_created": 1599768254, "time_updated": 1599768254, "views": 40, "favorited": 1, "tags": ["audio", "v3.3.7"], "votes": {"up": 0, "down": 1}}, {"id": "1360119402", "title": "Random Books and journals", "file_size": 4728, "preview_url": "", "description": "Files go in the books folder, includes extra books to find along the way of the game such as the journals of other explorers.", "time_created": 1523635759, "time_updated": 1523635759, "views": 1140, "favorited": 4, "tags": ["misc", "v3.1.3"], "votes": {"up": 1, "down": 3}}, {"id": "2613228042", "title": "", "file_size": 23429, "preview_url": "", "description": "", "time_created": 1632778290, "time_updated": 1632778752, "views": 22, "favorited": 0, "tags": ["v3.3.7"], "votes": {"up": 0, "down": 0}}, {"id": "2612692545", "title": "ShotGun crossbow", "file_size": 15048, "preview_url": "", "description": "its a gun :)", "time_created": 1632719188, "time_updated": 1632719188, "views": 42, "favorited": 0, "tags": ["models  ", "v3.3.7"], "votes": {"up": 0, "down": 0}}, {"id": "2538110888", "title": "Gnomes to elves", "file_size": 453604, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1689396082741833456/664165C11DCE668539D89C6BF700C6B55B686DA6/", "description": "Changes gnomes to elves ", "time_created": 1625503085, "time_updated": 1625503085, "views": 76, "favorited": 0, "tags": ["models  ", "v3.3.7"], "votes": {"up": 0, "down": 0}}, {"id": "2609178042", "title": "Start Zone and Armory of Randy", "file_size": 84133, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1637611797108551846/CB7D27D72D678CB553EA7D729287013245A42E0A/", "description": "Randy's Armory and Shop. This is the second (but not final) map in a series of mods that expand on the Randy Darendrake character and universe. This mod includes Randy's armory and his brothers shop. The armory is entered though the startzone shop.", "time_created": 1632381176, "time_updated": 1632382850, "views": 52, "favorited": 0, "tags": ["dungeons", "misc", "v3.3.7"], "votes": {"up": 0, "down": 0}}, {"id": "1821171397", "title": "The Bruh Box v1.0", "file_size": 10514350, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/775101441380129401/E6F4F49AF55FA7BE63310424D8AC489E4CF44A57/", "description": "I changed some things, possible updates to come.", "time_created": 1564600456, "time_updated": 1564603411, "views": 402, "favorited": 1, "tags": ["audio", "misc", "v3.2.3"], "votes": {"up": 0, "down": 2}}, {"id": "2532089777", "title": "Shared Vision", "file_size": 66, "preview_url": "", "description": "In multiplayer minimap vision is shared to others as long as your player is emitting light, or near a light source. There is no way to share vision when moving through dark areas.", "time_created": 1625010924, "time_updated": 1625010924, "views": 58, "favorited": 0, "tags": ["misc", "v3.3.7"], "votes": {"up": 0, "down": 0}}, {"id": "2328012636", "title": "Magic Mistletoe", "file_size": 383954, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1656727143126386859/0EFFE57B004B065578E92450DFD7518114EA0FD8/", "description": "Changes the Magic Missile sprite to a mistletoe and every mention of Magic Missile to Magic Mistletoe. Or at least it was supposed to, but it only changes the spellbook and magicstaff for some reason. I don't know why. My submission for the Barony Holiday Creation Challenge.", "time_created": 1608495508, "time_updated": 1608495508, "views": 88, "favorited": 1, "tags": ["textures", "v3.3.7"], "votes": {"up": 0, "down": 0}}, {"id": "2467381490", "title": "Global Experience Share", "file_size": 2100, "preview_url": "", "description": "EXP Share distance raise ONLY", "time_created": 1619325950, "time_updated": 1619325950, "views": 99, "favorited": 0, "tags": ["gameplay", "v3.3.7"], "votes": {"up": 0, "down": 0}}, {"id": "2512929139", "title": "pvp_total_domination", "file_size": 353526, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1770458617172577392/70F8C8954090865F7EBA2ACAF7F1A79848F18339/", "description": "a small 2-4 player pvp map little note: 1 this map only work with frendly fire 2 to restart go to the exit", "time_created": 1623339919, "time_updated": 1623341666, "views": 55, "favorited": 0, "tags": ["dungeons", "misc", "v3.3.7"], "votes": {"up": 0, "down": 0}}, {"id": "2327088021", "title": "Ulg's Wondrous Warpaints: Night (Male)", "file_size": 132090, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1655601151326175322/00DA0C9260BC26D0DD94ADFFBC1E957C886BC7A2/", "description": "With the success of Ulg's hair gel products with Goblins across the swamps, he's decided to open a new line of paint products designed for YOUR FACE! With such innovations, Ulg is bound to make more of a profit. This warpaint style is made from cave snail extract and several secret ingredients, and enclosed are instructions for the \"Night\" style of warpaint. Check Ulg's Collection for more hair styles and warpaints!", "time_created": 1608434234, "time_updated": 1608507642, "views": 19, "favorited": 0, "tags": ["models  ", "v3.3.7"], "votes": {"up": 0, "down": 0}}, {"id": "2322467085", "title": "Ulg's Wondrous Warpaints: Wisdom (Male)", "file_size": 12602, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1655600828600356288/7B13D5CA98C408DFB04EB13E20520C097EF410AC/", "description": "With the success of Ulg's hair gel products with Goblins across the swamps, he's decided to open a new line of paint products designed for YOUR FACE! With such innovations, Ulg is bound to make more of a profit. This warpaint style is made from dyes and several secret ingredients, and enclosed are instructions for the \"Wisdom\" style of warpaint. Find Ulg's hair packages below! The \"Punk\" Package The \"Groomed Gentlegoblin\" Package The \"Balding\" Package", "time_created": 1608091978, "time_updated": 1608091978, "views": 13, "favorited": 0, "tags": ["v3.3.7"], "votes": {"up": 0, "down": 0}}, {"id": "2323502414", "title": "Ezekal's Cursed Hair Gel: Bald (Male)", "file_size": 17269, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1655600916465690584/8564C12880A9857D9942EF3C55C1256C311C4E9B/", "description": "Makes the Vampire player race bald. Males only.", "time_created": 1608174638, "time_updated": 1608174638, "views": 19, "favorited": 0, "tags": ["models  ", "v3.3.7"], "votes": {"up": 0, "down": 0}}, {"id": "2322397959", "title": "Ulg's Wondrous Warpaints: War (Male)", "file_size": 14273, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1655600828599956310/676B41AEF61614CC664C2C2F0885BB2305BDD17D/", "description": "With the success of Ulg's hair gel products with Goblins across the swamps, he's decided to open a new line of paint products designed for YOUR FACE! With such innovations, Ulg is bound to make more of a profit. This warpaint style is made from human blood and several secret ingredients, and enclosed are instructions for the \"War\" style of warpaint. Find Ulg's hair packages below! The \"Punk\" Package The \"Groomed Gentlegoblin\" Package The \"Balding\" Package", "time_created": 1608085368, "time_updated": 1608085368, "views": 7, "favorited": 0, "tags": ["v3.3.7"], "votes": {"up": 0, "down": 0}}, {"id": "2322952203", "title": "Ulg's Facial Deformations: Troll-Touched (Male)", "file_size": 11303, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1655600828603026841/3CCC6AF835A69BDA8920825E5A5742C67000AA38/", "description": "Ulg's Facial Deformations!", "time_created": 1608135160, "time_updated": 1608135160, "views": 31, "favorited": 0, "tags": ["models  ", "v3.3.7"], "votes": {"up": 0, "down": 0}}, {"id": "2324649422", "title": "The Barony MMO!", "file_size": 2119175, "preview_url": "", "description": "Play Barony but with a Surface", "time_created": 1608266486, "time_updated": 1608266486, "views": 223, "favorited": 0, "tags": ["dungeons", "misc", "v3.3.7"], "votes": {"up": 0, "down": 0}}, {"id": "2322397727", "title": "Ulg's Blessed Hair Gel: Balding (Male)", "file_size": 13889, "preview_url": "https://steamuserimages-a.akamaihd.net/ugc/1655600828599954980/B0E1CD4ACCA94C4B9CD0F18FCD056B0E80C94739/", "description": "You ever feel like your Goblin could use a new 'do? With the power of Ulg's Blessed Hair Gel you can grow hair in an instant and style it any way you like using one of his various packages. Ulg's Balding package will make you notice there's hair everywhere except at the top of your now-shiny head. More hair packages can be found below! The \"Punk\" Package The \"Groomed Gentlegoblin\" Package The \"War\" warpaint style", "time_created": 1608085345, "time_updated": 1608085345, "views": 12, "favorited": 0, "tags": ["v3.3.7", "models  "], "votes": {"up": 0, "down": 0}}, {"id": "2277059359", "title": "Patch fr", "file_size": 160422, "preview_url": "", "description": "Traduction à-peu-près fr", "time_created": 1604493761, "time_updated": 1604493761, "views": 45, "favorited": 1, "tags": ["translations", "v3.3.7"], "votes": {"up": 0, "down": 0}}, {"id": "2059027263", "title": "Matt's Testmod Upload", "file_size": 16336, "preview_url": "", "description": "Few Starting Items", "time_created": 1586741111, "time_updated": 1587092807, "views": 77, "favorited": 2, "tags": ["gameplay", "v3.3.3"], "votes": {"up": 0, "down": 0}}]